Repository: Ace-tyl/DaysCounter2
Catalog: Lang/Resources.*.resx
Languages: ar, ja, sv_se, zh_cn, zh_hk, zh_tw

# timeZone_pos0530
source: India, Sri Lanka
ar: الهند، سريلانكا
ja: インド、スリランカ
sv_se: Indien, Sri Lanka
zh_cn: 印度、斯里兰卡
zh_hk: 印度、斯里蘭卡
zh_tw: 印度、斯里蘭卡

# timeZone_pos0545
source: Nepal
ar: نيبال
ja: ネパール
zh_cn: 尼泊尔
zh_hk: 尼泊爾
zh_tw: 尼泊爾

# timeZone_pos0600
source: Bangladesh, Bhutan, British Indian Ocean Territory, Kyrgyzstan, Russia (Omsk)
ar: بنغلاديش، بوتان، الإقليم البريطاني في المحيط الهندي، قيرغيزستان، روسيا (أومسك)
ja: バングラデシュ、ブータン、イギリス領インド洋地域、キルギス、ロシア（オムスク）
sv_se: Bangladesh, Bhutan, Brittiska Indiska oceanterritoriet, Kirgizistan, Ryssland (Omsk)
zh_cn: 孟加拉国、不丹、英属印度洋领地、吉尔吉斯斯坦、俄罗斯（鄂木斯克）
zh_hk: 孟加拉國、不丹、英屬印度洋領地、吉爾吉斯斯坦、俄羅斯（鄂木斯克）
zh_tw: 孟加拉、不丹、英屬印度洋領地、吉爾吉斯、俄羅斯（鄂木斯克）

# timeZone_pos0630
source: Cocos Islands, Myanmar
ar: جزر كوكوس، ميانمار
ja: ココス諸島、ミャンマー
sv_se: Cocosöarna, Myanmar
zh_cn: 科科斯群岛、缅甸
zh_hk: 科科斯群島、緬甸
zh_tw: 科科斯群島、緬甸

# timeZone_pos0700
source: Cambodia, Christmas Island, Indonesia (Sumatra, Java, West Kalimantan, Central Kalimantan), Laos, Mongolia (Bayan-Ölgii, Khovd, Uvs), Russia (Altai Krai, Altai Republic, Kemerovo, Khakassia, Krasnoyarsk, Novosibirsk, Tomsk, Tuva), Thailand, Vietnam
ar: كمبوديا، جزيرة كريسماس، إندونيسيا (سومطرة، جاوة، كاليمانتان الغربية، كاليمانتان الوسطى)، لاوس، منغوليا (بايان-أولجي، خوفد، أوس)، روسيا (إقليم ألتاي، جمهورية ألتاي، كيميروفو، خاكاسيا، كراسنويارسك، نوفوسيبيرسك، تومسك، توفا)، تايلاند، فيتنام
ja: カンボジア、クリスマス島、インドネシア（スマトラ、ジャワ、西カリマンタン、中カリマンタン）、 ラオス、モンゴル（バヤンウリゲ、コブド、ウブス）、ロシア（アルタイ地方、アルタイ共和国、クマーノヴォ、ハカス、クラスノヤルスク、ノヴォシビルスク、トムスク、トゥヴァ）、タイ、ベトナム
sv_se: Kambodja, Julön, Indonesien (Sumatra, Java, Västra Kalimantan, Centrala Kalimantan), Laos, Mongoliet (Bayan-Ölgii, Khovd, Uvs), Ryssland (Altaj kraj, Altajrepubliken, Kemerovo, Chakassien, Krasnojarsk, Novosibirsk, Tomsk, Tuva), Thailand, Vietnam
zh_cn: 柬埔寨、圣诞岛、印度尼西亚（苏门答腊、爪哇、西加里曼丹、中加里曼丹）、老挝、蒙古（巴彦乌列盖、科布多、乌布苏）、俄罗斯（阿尔泰边疆区、阿尔泰共和国、克麦罗沃、哈卡斯、克拉斯诺亚尔斯克、新西伯利亚、托木斯克、图瓦）、泰国、越南
zh_hk: 柬埔寨、聖誕島、印尼（蘇門答臘、爪哇、西加里曼丹、中加里曼丹）、老撾、蒙古（巴彥烏列蓋、科布多、烏布蘇）、俄羅斯（阿爾泰邊疆區、阿爾泰共和國、克麥羅沃、哈卡斯、克拉斯諾亞爾斯克、新西伯利亞、托木斯克、圖瓦）、泰國、越南
zh_tw: 柬埔寨、聖誕島、印尼（蘇門答臘、爪哇、西加里曼丹、中加里曼丹）、寮國、蒙古（巴彥烏列蓋、科布多、烏布蘇）、俄羅斯（阿爾及利亞邊疆區、阿爾泰共和國、克麥羅沃、哈卡斯、克拉斯諾亞爾斯克、新西伯利亞、托木斯克、圖瓦）、泰國、越南

# timeZone_pos0800
source: Australia (Western Australia), Brunei, China, Indonesia (South Kalimantan, East Kalimantan, North Kalimantan, Sulawesi, Lesser Sunda Islands), Malaysia, Mongolia (most), Philippines, Russia (Buryatia, Irkutsk), Singapore
ar: أستراليا (أستراليا الغربية)، بروناي، الصين، إندونيسيا (كاليمانتان الجنوبية، كاليمانتان الشرقية، كاليمانتان الشمالية، سولاويزي، جزر سوندا الصغرى)، ماليزيا، منغوليا (معظمها)، الفلبين، روسيا (بورياتيا، إركوتسك)، سنغافورة
ja: オーストラリア（西オーストラリア州）、ブルネイ、中国、インドネシア（南カリマンタン、東カリマンタン、北カリマンタン、スラウェシ、小スンダ諸島）、マレーシア、モンゴル（大部分）、フィリピン、ロシア（ブリヤート、イルクーツク）、シンガポール
sv_se: Australien (Västaustralien), Brunei, Kina, Indonesien (Södra Kalimantan, Östra Kalimantan, Norra Kalimantan, Sulawesi, Små Sundaöarna), Malaysia, Mongoliet (större delen), Filippinerna, Ryssland (Burjatien, Irkutsk), Singapore
zh_cn: 澳大利亚（西澳大利亚州）、文莱、中国、印度尼西亚（南加里曼丹、东加里曼丹、北加里曼丹、苏拉威西、小巽他群岛）、马来西亚、蒙古（大部分地区）、菲律宾、俄罗斯（布里亚特、伊尔库茨克）、新加坡
zh_hk: 澳洲（西澳）、文萊、中國、印尼（南加里曼丹、東加里曼丹、北加里曼丹、蘇拉威西、小巽他群島）、馬來西亞、蒙古（大部分）、菲律賓、俄羅斯（布里亞特、伊爾庫茨克）、新加坡
zh_tw: 澳洲（西澳）、汶萊、中國、印尼（南加里曼丹、東加里曼丹、北加里曼丹、蘇拉威西、小巽他群島）、馬來西亞、蒙古（大部分地區）、菲律賓、俄羅斯（布里亞特、伊爾庫茨克）、新加坡

# timeZone_pos0845
source: Australia (Eucla)
ar: أستراليا (يوكلا)
ja: オーストラリア（ユーカラ）
sv_se: Australien (Eucla)
zh_cn: 澳大利亚（尤克拉）
zh_hk: 澳洲（尤克拉）
zh_tw: 澳洲（尤克拉）

# timeZone_pos0900
source: Indonesia (Maluku Islands, Western New Guinea), Japan, North Korea, Palau, Russia (Amur, Sakha (most), Zabaykalsky), South Korea, Timor-Leste
ar: إندونيسيا (جزر الملوك، غينيا الجديدة الغربية)، اليابان، كوريا الشمالية، بالاو، روسيا (أمور، ساخا (معظمها)، زابايكالسكي)، كوريا الجنوبية، تيمور الشرقية
ja: インドネシア（マルク諸島、西ニューギニア）、日本、朝鮮、パラオ、ロシア（アムール、サハ（大部分）、外ベガール）、韓国、東ティモール
sv_se: Indonesien (Moluckerna, Västra Nya Guinea), Japan, Nordkorea, Palau, Ryssland (Amur, Sacha (större delen), Zabajkalsk), Sydkorea, Östtimor
zh_cn: 印度尼西亚（马鲁古群岛、西新几内亚）、日本、朝鲜、帕劳、俄罗斯（阿穆尔、萨哈（大部分）、外贝加尔）、韩国、东帝汶
zh_hk: 印尼（馬魯古群島、西新幾內亞）、日本、北韓、帕勞、俄羅斯（阿穆爾、薩哈（大部分）、外貝加爾）、南韓、東帝汶
zh_tw: 印尼（馬魯古群島、西紐幾內亞）、日本、北韓、帛琉、俄羅斯（阿穆爾、薩哈（大部分）、外貝加爾）、南韓、東帝汶

# timeZone_pos0930
source: Australia (Northern Territory); Australia (South Australia, Yancowinna County) without DST
ar: أستراليا (الإقليم الشمالي)؛ أستراليا (جنوب أستراليا، مقاطعة يانكوينا) بدون توقيت صيفي
ja: オーストラリア（ノーザンテリトリー）； オーストラリア（南オーストラリア州、ヤンコウィナ郡）は夏時間を実施しない
sv_se: Australien (Northern Territory); Australien (South Australia, Yancowinna County) utan sommartid
zh_cn: 澳大利亚（北领地）； 澳大利亚（南澳大利亚州，扬科温纳县）不实行夏令时
zh_hk: 澳洲（北領地）； 澳洲（南澳、揚科溫納縣）不設夏令時間
zh_tw: 澳洲（北領地）； 澳洲（南澳大利亞州，揚科溫納縣）不實施夏令時

# timeZone_pos1000
source: Australia (Queensland), Guam, Micronesia (Chuuk, Yap), Northern Mariana Islands, Papua New Guinea (most), Russia (Jewish, Khabarovsk, Primorsky, Sakha (central-east)); Australia (Australian Capital Territory, Jervis Bay Territory, New South Wales (most), Tasmania, Victoria) without DST
ar: أستراليا (كوينزلاند)، غوام، ميكرونيسيا (تشوك، ياب)، جزر ماريانا الشمالية، بابوا غينيا الجديدة (معظمها)، روسيا (المنطقة اليهودية، خاباروفسك، بريمورسكي، ساخا (وسط شرق))؛ أستراليا (إقليم العاصمة الأسترالية، إقليم خليج جيرفيس، نيوساوث ويلز (معظمها)، تاسمانيا، فيكتوريا) بدون توقيت صيفي
ja: オーストラリア（クイーンズランド州）、グアム、ミクロネシア（チューク、ヤップ）、北マリアナ諸島、パプアニューギニア（大部分）、ロシア（ユダヤ自治共和国、ハバロフスク地方、沿海地方、サハ共和国（中東部））； オーストラリア（オーストラリア首都特別地域、ジャビズ湾地域、ニューサウスウェールズ州（大部分）、タスマニア州、ビクトリア州）は夏時間を実施しない
sv_se: Australien (Queensland), Guam, Mikronesien (Chuuk, Yap), Nordmarianerna, Papua Nya Guinea (större delen), Ryssland (Judiska autonoma oblastet, Chabarovsk, Primorje, Sacha (centrala–östra)); Australien (Australian Capital Territory, Jervis Bay Territory, New South Wales (större delen), Tasmanien, Victoria) utan sommartid
zh_cn: 澳大利亚（昆士兰）、关岛、密克罗尼西亚（丘克、雅浦）、北马里亚纳群岛、巴布亚新几内亚（大部分地区）、俄罗斯（犹太、哈巴罗夫斯克、滨海边疆区、萨哈（中东部））； 澳大利亚（澳大利亚首都领地、杰维斯湾领地、新南威尔士州（大部分）、塔斯马尼亚州、维多利亚州）不实行夏令时
zh_hk: 澳洲（昆士蘭）、關島、密克羅尼西亞（楚克、雅浦）、北馬里亞納群島、巴布亞新幾內亞（大部分）、俄羅斯（猶太自治州、哈巴羅夫斯克、濱海邊疆區、薩哈（中東部））； 澳洲（首都領地、傑維斯灣領地、新南威爾士州（大部分）、塔斯曼尼亞、維多利亞州）不設夏令時間
zh_tw: 澳洲（昆士蘭）、關島、密克羅尼西亞（丘克、雅浦）、北馬裡亞納群島、巴布亞紐幾內亞（大部分地區）、俄羅斯（猶太、哈巴羅夫斯克、濱海邊疆區、薩哈（中東部））； 澳洲（澳洲首都領地、傑維斯灣領地、新南威爾斯（大部分）、塔斯馬尼亞州、維多利亞州）不實施夏令時

# timeZone_pos1030
source: Australia (Lord Howe Island) without DST; Australia (South Australia, Yancowinna County) with DST
ar: أستراليا (جزيرة لورد هاو) بدون توقيت صيفي؛ أستراليا (جنوب أستراليا، مقاطعة يانكوينا) مع توقيت صيفي
ja: オーストラリア（ロード・デ・ケズ島）は夏時間を実施しない； オーストラリア（南オーストラリア州、ヤンコウィナ郡）は夏時間を実施
sv_se: Australien (Lord Howe Island) utan sommartid; Australien (South Australia, Yancowinna County) med sommartid
zh_cn: 澳大利亚（豪勋爵岛）不实行夏令时； 澳大利亚（南澳大利亚州，扬科温纳县）实行夏令时
zh_hk: 澳洲（豪勳爵島）不設夏令時間； 澳洲（南澳、揚科溫納縣）設夏令時間
zh_tw: 澳洲（豪勳爵島）不實施夏令時； 澳洲（南澳大利亞州，揚科溫納縣）實施夏令時

# timeZone_pos1100
source: Micronesia (Kosrae, Pohnpei), New Caledonia, Papua New Guinea (Bougainville), Russia (Magadan, Sakha (east), Sakhalin), Solomon Islands, Vanuatu; Norfolk Island without DST; Australia (Australian Capital Territory, Jervis Bay Territory, Lord Howe Island, New South Wales (most), Tasmania, Victoria) with DST
ar: ميكرونيسيا (كوسراي، بونبي)، كاليدونيا الجديدة، بابوا غينيا الجديدة (بوغانفيل)، روسيا (ماغادان، ساخا (شرق)، سخالين)، جزر سليمان، فانواتو؛ جزيرة نورفولك بدون توقيت صيفي؛ أستراليا (إقليم العاصمة الأسترالية، إقليم خليج جيرفيس، جزيرة لورد هاو، نيوساوث ويلز (معظمها)، تاسمانيا، فيكتوريا) مع توقيت صيفي
ja: ミクロネシア（コスラエ、ポナペ）、ニューカレドニア、パプアニューギニア（ブガンビル）、ロシア（マガダン、サハ（東部）、サハリン島）、ソロモン諸島、バヌアツ； ノーフォーク島は夏時間を実施しない； オーストラリア（オーストラリア首都特別地域、ジャビズ湾地域、ロード・デ・クーカード島、ニューサウスウェールズ州（大部分）、タスマニア州、ビクトリア州）は夏時間を実施
sv_se: Mikronesien (Kosrae, Pohnpei), Nya Kaledonien, Papua Nya Guinea (Bougainville), Ryssland (Magadan, Sacha (östra), Sachalin), Salomonöarna, Vanuatu; Norfolkön utan sommartid; Australien (Australian Capital Territory, Jervis Bay Territory, Lord Howe Island, New South Wales (större delen), Tasmanien, Victoria) med sommartid
zh_cn: 密克罗尼西亚（科斯雷、波纳佩）、新喀里多尼亚、巴布亚新几内亚（布干维尔）、俄罗斯（马加丹、萨哈（东部）、萨哈林岛）、所罗门群岛、瓦努阿图； 诺福克岛不实行夏令时； 澳大利亚（澳大利亚首都领地、杰维斯湾领地、豪勋爵岛、新南威尔士州（大部分）、塔斯马尼亚州、维多利亚州）实行夏令时
zh_hk: 密克羅尼西亞（科斯雷、波納佩）、新喀里多尼亞、巴布亞新幾內亞（布干維爾）、俄羅斯（馬加丹、薩哈（東部）、庫頁島）、所羅門群島、瓦努阿圖； 諾福克島不設夏令時間； 澳洲（首都領地、傑維斯灣領地、豪勳爵島、新南威爾士州（大部分）、塔斯曼尼亞、維多利亞州）設夏令時間
zh_tw: 密克羅尼西亞（科斯雷、波納佩）、新喀裡多尼亞、巴布亞紐幾內亞（布干維爾）、俄羅斯（馬加丹、薩哈（東部）、庫頁島）、所羅門群島、萬那杜； 諾福克島不實施夏令時； 澳洲（澳洲首都領地、傑維斯灣領地、豪勳爵島、新南威爾斯（大部分）、塔斯馬尼亞州、維多利亞州）實施夏令時

# timeZone_pos1200
source: Fiji, Kiribati (Gilbert Islands), Marshall Islands, Nauru, Russia (Chukotka, Kamchatka), Tuvalu, Wake Island, Wallis and Futuna; New Zealand (most) without DST; Norfolk Island with DST
ar: فيجي، كيريباتي (جزر جيلبرت)، جزر مارشال، ناورو، روسيا (تشوكوتكا، كامتشاتكا)، توفالو، جزيرة ويك، واليس وفوتونا؛ نيوزيلندا (معظمها) بدون توقيت صيفي؛ جزيرة نورفولك مع توقيت صيفي
ja: フィジー、キリバス（ギルバート諸島）、マーシャル諸島、ナウル、ロシア（チュクチ半島、カムチャツカ半島）、ツバル、ウェーク島、ヴァリズ・フォチュナ諸島； ニュージーランド（大部分）は夏時間を実施しない； ノーフォーク島は夏時間を実施
sv_se: Fiji, Kiribati (Gilbertöarna), Marshallöarna, Nauru, Ryssland (Tjuktjien, Kamtjatka), Tuvalu, Wakeön, Wallis och Futuna; Nya Zeeland (större delen) utan sommartid; Norfolkön med sommartid
zh_cn: 斐济、基里巴斯（吉尔伯特群岛）、马绍尔群岛、瑙鲁、俄罗斯（楚科奇半岛、堪察加半岛）、图瓦卢、威克岛、瓦利斯和富图纳群岛； 新西兰（大部分地区）不实行夏令时； 诺福克岛实行夏令时
zh_hk: 斐濟、基里巴斯（吉爾伯特群島）、馬紹爾群島、瑙魯、俄羅斯（楚科奇、堪察加）、圖瓦盧、威克島、瓦利斯和富圖納； 新西蘭（大部分）不設夏令時間； 諾福克島設夏令時間
zh_tw: 斐濟、吉里巴斯（吉爾伯特群島）、馬紹爾群島、諾魯、俄羅斯（楚科奇半島、堪察加半島）、吐瓦魯、威克島、瓦利斯和富圖納群島； 紐西蘭（大部分地區）不實施夏令時； 諾福克島實施夏令時

# timeZone_pos1245
source: New Zealand (Chatham Islands) without DST
ar: نيوزيلندا (جزر تشاتام) بدون توقيت صيفي
ja: ニュージーランド（チャタム諸島）は夏時間を実施しない
sv_se: Nya Zeeland (Chathamöarna) utan sommartid
zh_cn: 新西兰（查塔姆群岛）不实行夏令时
zh_hk: 新西蘭（查塔姆群島）不設夏令時間
zh_tw: 紐西蘭（查塔姆群島）不實施夏令時

# timeZone_pos1300
source: Kiribati (Phoenix Islands), Samoa, Tokelau, Tonga; New Zealand (most) with DST
ar: كيريباتي (جزر فينيكس)، ساموا، توكيلاو، تونغا؛ نيوزيلندا (معظمها) مع توقيت صيفي
ja: キリバス（フェニックス諸島）、サモア、トケラウ、トンガ； ニュージーランド（大部分）は夏時間を実施
sv_se: Kiribati (Phoenixöarna), Samoa, Tokelau, Tonga; Nya Zeeland (större delen) med sommartid
zh_cn: 基里巴斯（菲尼克斯群岛）、萨摩亚、托克劳、汤加； 新西兰（大部分地区）实行夏令时
zh_hk: 基里巴斯（鳳凰群島）、薩摩亞、托克勞、湯加； 新西蘭（大部分）設夏令時間
zh_tw: 吉里巴斯（菲尼克斯群島）、薩摩亞、托克勞、東加； 紐西蘭（大部分地區）實施夏令時

# timeZone_pos1345
source: New Zealand (Chatham Islands) with DST
ar: نيوزيلندا (جزر تشاتام) مع توقيت صيفي
ja: ニュージーランド（チャタム諸島）は夏時間を実施
sv_se: Nya Zeeland (Chathamöarna) med sommartid
zh_cn: 新西兰（查塔姆群岛）实行夏令时
zh_hk: 新西蘭（查塔姆群島）設夏令時間
zh_tw: 紐西蘭（查塔姆群島）實施夏令時

# timeZone_pos1400
source: Kiribati (Line Islands)
ar: كيريباتي (جزر لاين)
ja: キリバス（ライアン諸島）
sv_se: Kiribati (Lineöarna)
zh_cn: 基里巴斯（莱恩群岛）
zh_hk: 基里巴斯（萊恩群島）
zh_tw: 吉里巴斯（萊恩群島）
