Repository: Ace-tyl/DaysCounter2
Catalog: Lang/Resources.*.resx
Languages: ar, ja, sv_se, zh_cn, zh_hk, zh_tw

# ui_currentTime
source: Current Time:
ar: الوقت الحالي:
ja: 現在の時間：
sv_se: Aktuell tid:
zh_cn: 当前时间：
zh_hk: 當前時間：
zh_tw: 目前時間：

# ui_delete
source: Delete
ar: حذف
ja: 削除
sv_se: Stryka
zh_cn: 删除
zh_hk: 刪除
zh_tw: 刪除

# ui_edit
source: Edit
ar: تحرير
ja: 編集
sv_se: Redigera
zh_cn: 修改
zh_hk: 編輯
zh_tw: 編輯

# editor_date
source: Event Date:
ar: تاريخ الحدث:
ja: イベント日：
sv_se: Datum:
zh_cn: 事件日期：
zh_hk: 事件日期：
zh_tw: 事件日期：

# editor_date_day
source: Day
ar: يوم
ja: 日
sv_se: Dag
zh_cn: 日
zh_hk: 日
zh_tw: 日

# editor_date_month
source: Month
ar: شهر
ja: 月
sv_se: Månad
zh_cn: 月
zh_hk: 月
zh_tw: 月

# editor_date_year
source: Year
ar: سنة
ja: 年
sv_se: År
zh_cn: 年
zh_hk: 年
zh_tw: 年

# editor_name
source: Event Name:
ar: اسم الحدث:
ja: イベント名：
sv_se: Namn:
zh_cn: 事件名称：
zh_hk: 事件名稱：
zh_tw: 事件名稱：

# editor_title
source: Edit Event
ar: تحرير الحدث
ja: イベントを編集
sv_se: Rediger
zh_cn: 编辑事件
zh_hk: 編輯事件
zh_tw: 編輯事件

# ui_new
source: New
ar: جديد
ja: 新規作成
sv_se: Ny
zh_cn: 添加
zh_hk: 新建
zh_tw: 新增

# ui_settings
source: Settings
ar: الإعدادات
ja: 設定
sv_se: Inställningar
zh_cn: 设置
zh_hk: 設定
zh_tw: 設定

# ui_timerAgo
source: {0}d {1}h {2}m {3}s ago
ar: منذ {0} يوم {1} ساعة {2} دقيقة {3} ثانية
ja: {0} 日 {1} 時間 {2} 分 {3} 秒前
sv_se: {0}d {1}t {2}m {3}s föräsedan
zh_cn: {0} 天 {1} 小时 {2} 分 {3} 秒前
zh_hk: {0} 日 {1} 個鐘 {2} 分 {3} 秒前
zh_tw: {0} 天 {1} 小時 {2} 分 {3} 秒前

# ui_timerLater
source: {0}d {1}h {2}m {3}s later
ar: بعد {0} يوم {1} ساعة {2} دقيقة {3} ثانية
ja: {0} 日 {1} 時間 {2} 分 {3} 秒後
sv_se: {0}d {1}t {2}m {3}s sedan
zh_cn: {0} 天 {1} 小时 {2} 分 {3} 秒后
zh_hk: {0} 日 {1} 個鐘 {2} 分 {3} 秒後
zh_tw: {0} 天 {1} 小時 {2} 分 {3} 秒後

# ui_version
source: Version
ar: الإصدار
ja: バージョン
zh_cn: 版本
zh_hk: 版本
zh_tw: 版本

# editor_year_bc
source: ({0:.} BC)
ar: (قبل الميلاد {0:.})
ja: （紀元前 {0:.}）
sv_se: (F.K. {0:.})
zh_cn: （公元前 {0:.}）
zh_hk: （公元前 {0:.}）
zh_tw: （公元前 {0:.}）

# editor_time
source: Event Time:
ar: وقت الحدث:
ja: イベント時間：
sv_se: Tid:
zh_cn: 事件时间：
zh_hk: 事件時間：
zh_tw: 事件時間：

# editor_time_hour
source: Hour
ar: ساعة
ja: 時
sv_se: Timma
zh_cn: 时
zh_hk: 時
zh_tw: 時

# editor_time_minute
source: Minute
ar: دقيقة
ja: 分
sv_se: Minut
zh_cn: 分
zh_hk: 分
zh_tw: 分

# editor_time_second
source: Second
ar: ثانية
ja: 秒
sv_se: Sekund
zh_cn: 秒
zh_hk: 秒
zh_tw: 秒

# editor_time_timeZone
source: Time Zone
ar: المنطقة الزمنية
ja: 時間帯
sv_se: Tidszon
zh_cn: 时区
zh_hk: 時區
zh_tw: 時區

# editor_loop
source: Loop
ar: تكرار
ja: ループ
sv_se: Ögla
zh_cn: 循环
zh_hk: 循環
zh_tw: 循環

# editor_loop_warn
source: Loop will be activated only after the set time has elapsed.
ar: سيتم تنشيط التكرار فقط بعد انقضاء الوقت المحدد.
ja: ループは設定時間が経過した後にのみアクティブ化されます。
sv_se: Ögla ska aktivera bara efter ställande tid.
zh_cn: 循环仅在设定时间结束后启用。
zh_hk: 只有過咗設定時間之後先會啟動循環。
zh_tw: 循環功能將在設定的時間結束後啟動。

# editor_loop_second
source: Second(s)
ar: ثانية
ja: 秒
sv_se: Sekund(er)
zh_cn: 秒
zh_hk: 秒
zh_tw: 秒

# editor_loop_minute
source: Minute(s)
ar: دقيقة
ja: 分
sv_se: Minut(er)
zh_cn: 分钟
zh_hk: 分鐘
zh_tw: 分鐘

# editor_loop_hour
source: Hour(s)
ar: ساعة
ja: 時間
sv_se: Timma(r)
zh_cn: 小时
zh_hk: 鐘頭
zh_tw: 小時

# editor_loop_day
source: Day(s)
ar: يوم
ja: 日
sv_se: Dag(ar)
zh_cn: 天
zh_hk: 日
zh_tw: 天

# editor_loop_month
source: Month(s)
ar: شهر
ja: ヶ月
sv_se: Månad(er)
zh_cn: 月
zh_hk: 個月
zh_tw: 個月

# editor_loop_year
source: Year(s)
ar: سنة
ja: 年
sv_se: År
zh_cn: 年
zh_hk: 年
zh_tw: 年

# editor_save
source: Save
ar: حفظ
ja: 保存
sv_se: Spara
zh_cn: 保存
zh_hk: 保存
zh_tw: 儲存

# ui_delete_warn_title
source: Warning
ar: تحذير
ja: 警告
sv_se: Varning
zh_cn: 警告
zh_hk: 警告
zh_tw: 警告

# ui_delete_warn
source: Do you really want to delete this event? The operation is irrevocable!
ar: هل تريد حقًا حذف هذا الحدث؟ لا يمكن التراجع عن هذه العملية!
ja: 本当にこのイベントを削除しますか？ 操作は取り消せません！
sv_se: Är du säker att stryka det där evenemanget? Du kan inte ångra den operationen!
zh_cn: 你确定要删除这个事件吗？ 该操作不可撤回！ 如果确定，请点击 Yes，否则点击 No。
zh_hk: 你真係想刪除呢個事件？ 呢個操作係無法撤銷嘅！
zh_tw: 你確定要刪除這個事件嗎？ 該操作不可撤回！

# timeZone_neg1200
source: Anywhere on Earth (AoE); Baker Island, Howland Island
ar: آخر منطقة زمنية في العالم (AoE)؛ جزيرة بيكر، جزيرة هاولاند
ja: 世界最遅のタイムゾーン（AoE）； ベッカー島、ハウラン島
sv_se: Anywhere on Earth (AoE); Bakerön, Howlandön
zh_cn: 全球最晚时区（AoE）； 贝克岛、豪兰岛
zh_hk: 全球任何地方（AoE）； 貝克島、豪蘭島
zh_tw: 全球最晚時區（AoE）； 貝克島、豪蘭島

# timeZone_neg1100
source: American Samoa, Jarvis Island, Kingman Reef, Midway Atoll, Niue, Palmyra Atoll
ar: ساموا الأمريكية، جزيرة جارفيس، شعب كينغمان، جزيرة ميدواي، نييوي، جزيرة بالميرا المرجانية
ja: 米領サモア、ジャービス島、キンマン礁、ミッドウェー島、ニウエ、パルミラ環礁
sv_se: Amerikanska Samoa, Jarvisön, Kingman Reef, Midwayatollen, Niue, Palmyraatollen
zh_cn: 美属萨摩亚、贾维斯岛、金曼礁、中途岛、纽埃、巴尔米拉环礁
zh_hk: 美屬薩摩亞、賈維斯島、金曼礁、中途島、紐埃、帕爾米拉環礁
zh_tw: 美屬薩摩亞、賈維斯島、金曼礁、中途島環礁、紐埃、帕爾米拉環礁

# timeZone_neg1000
source: Cook Islands, French Polynesia (most), Johnston Atoll, United States (Hawaii); United States (Andreanof Islands, Islands of Four Mountains, Near Islands, Rat Islands) without DST
ar: جزر كوك، بولينيزيا الفرنسية (معظمها)، جزيرة جونستون المرجانية، الولايات المتحدة (هاواي)؛ الولايات المتحدة (جزر أندريانوف، جبال الأربعة، الجزر القريبة، جزر رات) بدون توقيت صيفي
ja: クック諸島、フランス領ポリネシア（大部分）、ジョンストン環礁、アメリカ（ハワイ）； アメリカ（アンドレノフ諸島、フォー・マウンテン諸島、ニア諸島、ラット諸島）は夏時間を実施しない
sv_se: Cooköarna, Franska Polynesien (större delen), Johnstonatollen, USA (Hawaii); USA (Andreanoföarna, Islands of Four Mountains, Nearöarna, Råttöarna) utan sommartid
zh_cn: 库克群岛、法属波利尼西亚（大部分地区）、约翰斯顿环礁、美国（夏威夷）； 美国（安德烈诺夫群岛、四山群岛、近岛、拉特群岛）不实行夏令时
zh_hk: 庫克群島、法屬波利尼西亞（大部分）、約翰斯頓環礁、美國（夏威夷）； 美國（安德烈亞諾夫群島、四山群島、近島群、拉特群島）不設夏令時間
zh_tw: 庫克群島、法屬玻里尼西亞（大部分地區）、約翰斯頓環礁、美國（夏威夷）； 美國（安德烈諾夫群島、四山群島、近島、拉特群島）不實施夏令時

# timeZone_neg0930
source: French Polynesia (Marquesas Islands)
ar: بولينيزيا الفرنسية (جزر ماركيساس)
ja: フランス領ポリネシア（マルケサス諸島）
sv_se: Franska Polynesien (Marquesasöarna)
zh_cn: 法属波利尼西亚（马克萨斯群岛）
zh_hk: 法屬波利尼西亞（馬克薩斯群島）
zh_tw: 法屬玻里尼西亞（馬克薩斯群島）

# timeZone_neg0900
source: French Polynesia (Gambier Islands); United States (Alaska (most)) without DST; United States (Andreanof Islands, Islands of Four Mountains, Near Islands, Rat Islands) with DST
ar: بولينيزيا الفرنسية (جزر غامبير)؛ الولايات المتحدة (ألاسكا (معظمها)) بدون توقيت صيفي؛ الولايات المتحدة (جزر أندريانوف، جبال الأربعة، الجزر القريبة، جزر رات) مع توقيت صيفي
ja: フランス領ポリネシア（ガンビール諸島）； アメリカ（アラスカ（大部分））は夏時間を実施しない； アメリカ（アンドレノフ諸島、フォー・マウンテン諸島、ニア諸島、ラット諸島）は夏時間を実施
sv_se: Franska Polynesien (Gambieröarna); USA (Alaska (större delen)) utan sommartid; USA (Andreanoföarna, Islands of Four Mountains, Nearöarna, Råttöarna) med sommartid
zh_cn: 法属波利尼西亚（甘比尔群岛）； 美国（阿拉斯加（大部分））不实行夏令时； 美国（安德烈诺夫群岛、四山群岛、近岛、拉特群岛）实行夏令时
zh_hk: 法屬波利尼西亞（甘比爾群島）； 美國（阿拉斯加（大部分））不設夏令時間； 美國（安德烈亞諾夫群島、四山群島、近島群、拉特群島）設夏令時間
zh_tw: 法屬玻里尼西亞（甘比爾群島）； 美國（阿拉斯加（大部分））不實施夏令時； 美國（安德烈諾夫群島、四山群島、近島、拉特群島）實施夏令時

# timeZone_neg0800
source: Clipperton Island, Pitcairn Islands; Canada (British Columbia (most)), Mexico (Baja California), United States (California, Idaho (north), Nevada (most), Oregon (most), Washington) without DST; United States (Alaska (most)) with DST
ar: جزيرة كليبرتون، جزر بيتكيرن؛ كندا (كولومبيا البريطانية (معظمها))، المكسيك (باخا كاليفورنيا)، الولايات المتحدة (كاليفورنيا، أيداهو (شمال)، نيفادا (معظمها)، أوريغون (معظمها)، واشنطن) بدون توقيت صيفي؛ الولايات المتحدة (ألاسكا (معظمها)) مع توقيت صيفي
ja: クリッパートン島、ピトケアン諸島； カナダ（ブリティッシュコロンビア州（大部分））、メキシコ（バハ・カリフォルニア州）、アメリカ（カリフォルニア州、アイダホ州（北部）、ネバダ州（大部分）、オレゴン州（大部分）、ワシントン州）は夏時間を実施しない； アメリカ（アラスカ州（大部分））は夏時間を実施
sv_se: Clippertonön, Pitcairnöarna; Kanada (British Columbia (större delen)), Mexiko (Baja California), USA (Kalifornien, Idaho (norra), Nevada (större delen), Oregon (större delen), Washington) utan sommartid; USA (Alaska (större delen)) med sommartid
zh_cn: 克利珀顿岛、皮特凯恩群岛； 加拿大（不列颠哥伦比亚省（大部分））、墨西哥（下加利福尼亚州）、美国（加利福尼亚州、爱达荷州（北部）、内华达州（大部分）、俄勒冈州（大部分）、华盛顿州）不实行夏令时； 美国（阿拉斯加（大部分））实行夏令时
zh_hk: 克利珀頓島、皮特凱恩群島； 加拿大（不列顛哥倫比亞省（大部分））、墨西哥（下加利福尼亞州）、美國（加州、愛達荷州（北部）、內華達州（大部分）、俄勒岡州（大部分）、華盛頓州）不設夏令時間； 美國（阿拉斯加（大部分））設夏令時間
zh_tw: 克利珀頓島、皮特凱恩群島； 加拿大（不列顛哥倫比亞省（大部分））、墨西哥（下加利福尼亞州）、美國（加利福尼亞州、愛達荷州（北部）、內華達州（大部分）、俄勒岡州（大部分）、華盛頓州）不實施夏令時； 美國（阿拉斯加（大部分））實施夏令時

# timeZone_neg0700
source: Canada (British Columbia (northeast), Yukon), Mexico (Baja California Sur, Nayarit (most), Sinaloa, Sonora), United States (Arizona (most)); Canada (Alberta, British Columbia (southeast), Northwest Territories, Nunavut (west), Saskatchewan (Lloydminster area)), Mexico (Chihuahua (northwest border)), United States (Arizona (Navajo Nation), Colorado, Idaho (most), Kansas (west), Montana, Nebraska (west), New Mexico, Nevada (northeast border), North Dakota (southwest), Oregon (east), South Dakota (west), Texas (west), Utah, Wyoming) without DST; Canada (British Columbia (most)), Mexico (Baja California), United States (California, Idaho (north), Nevada (most), Oregon (most), Washington) with DST
ar: كندا (كولومبيا البريطانية (شمال شرق)، يوكون)، المكسيك (باخا كاليفورنيا سور، ناياريت (معظمها)، سينالوا، سونورا)، الولايات المتحدة (أريزونا (معظمها))؛ كندا (ألبرتا، كولومبيا البريطانية (جنوب شرق)، الأقاليم الشمالية الغربية، نونافوت (غرب)، ساسكاتشوان (منطقة لويدمينيستر))، المكسيك (تشيواوا (الحدود الشمالية الغربية))، الولايات المتحدة (أريزونا (أمة نافاجو)، كولورادو، أيداهو (معظمها)، كانساس (غرب)، مونتانا، نبراسكا (غرب)، نيومكسيكو، نيفادا (الحدود الشمالية الشرقية)، داكوتا الشمالية (جنوب غرب)، أوريغون (شرق)، داكوتا الجنوبية (غرب)، تكساس (غرب)، يوتا، وايومنغ) بدون توقيت صيفي؛ كندا (كولومبيا البريطانية (معظمها))، المكسيك (باخا كاليفورنيا)، الولايات المتحدة (كاليفورنيا، أيداهو (شمال)، نيفادا (معظمها)، أوريغون (معظمها)، واشنطن) مع توقيت صيفي
ja: カナダ（ブリティッシュコロンビア州（北東部）、ユーコン準州）、メキシコ（バハ・カリフォルニア州、ナヤリット州（大部分）、シナロア州、ソノラ州）、アメリカ（アリゾナ州（大部分））； カナダ（アルバータ州、ブリティッシュコロンビア州（南東部）、ノースウェスト準州、ヌナブト準州（西部）、サスカチュワン州（ロイドミンスター地域））、メキシコ（チワワ州（北西部国境））、アメリカ（アリゾナ州（ナバホ族居留地）、コロラド州、アイダホ州（大部分）、 カンザス州（西部）、モンタナ州、ネブラスカ州（西部）、ニューメキシコ州、ネバダ州（北東部国境）、ノースダコタ州（南西部）、オレゴン州（東部）、サウスダコタ州（西部）、テキサス州（西部）、ユタ州、ワイオミング州）は夏時間を実施しない； カナダ（ブリティッシュコロンビア州（大部分））、メキシコ（バハ・カリフォルニア州）、アメリカ（カリフォルニア州、アイダホ州（北部）、ネバダ州（大部分）、オレゴン州（大部分）、ワシントン州）は夏時間を実施
sv_se: Kanada (British Columbia (nordost), Yukon), Mexiko (Baja California Sur, Nayarit (större delen), Sinaloa, Sonora), USA (Arizona (större delen)); Kanada (Alberta, British Columbia (sydost), Northwest Territories, Nunavut (västra), Saskatchewan (Lloydminsterområdet)), Mexiko (Chihuahua (nordvästra gränsen)), USA (Arizona (Navajo Nation), Colorado, Idaho (större delen), Kansas (västra), Montana, Nebraska (västra), New Mexico, Nevada (nordöstra gränsen), North Dakota (sydväst), Oregon (östra), South Dakota (västra), Texas (västra), Utah, Wyoming) utan sommartid; Kanada (British Columbia (större delen)), Mexiko (Baja California), USA (Kalifornien, Idaho (norra), Nevada (större delen), Oregon (större delen), Washington) med sommartid
zh_cn: 加拿大（不列颠哥伦比亚省（东北部）、育空地区）、墨西哥（南下加利福尼亚州、纳亚里特州（大部分）、锡那罗州、索诺拉州）、美国（亚利桑那州（大部分））； 加拿大（阿尔伯塔省、不列颠哥伦比亚省（东南部）、西北地区、努纳武特（西部）、萨斯喀彻温省（劳埃德明斯特地区））、墨西哥（奇瓦瓦州（西北边境））、美国（亚利桑那州（纳瓦霍族领地）、科罗拉多州、爱达荷州（大部分）、堪萨斯州（西部）、蒙大拿州、内布拉斯加州（西部）、新墨西哥州、内华达州（东北边境）、北达科他州（西南部）、俄勒冈州（东部）、南达科他州（西部）、德克萨斯州（西部）、犹他州、怀俄明州）不实行夏令时； 加拿大（不列颠哥伦比亚省（大部分））、墨西哥（下加利福尼亚州）、美国（加利福尼亚州、爱达荷州（北部）、内华达州（大部分）、俄勒冈州（大部分）、华盛顿州）实行夏令时
zh_hk: 加拿大（不列顛哥倫比亞省（東北部）、育空）、墨西哥（南下加利福尼亞州、納亞里特州（大部分）、錫那羅亞州、索諾拉州）、美國（亞利桑那州（大部分））； 加拿大（阿爾伯塔省、不列顛哥倫比亞省（東南部）、西北地區、努納武特（西部）、薩斯喀徹溫省（勞埃德明斯特地區））、墨西哥（奇瓦瓦州（西北邊境））、美國（亞利桑那州（納瓦霍族地區）、科羅拉多州、愛達荷州（大部分）、堪薩斯州（西部）、蒙大拿州、內布拉斯加州（西部）、新墨西哥州、內華達州（東北邊境）、北達科他州（西南部）、俄勒岡州（東部）、南達科他州（西部）、德州（西部）、猶他州、懷俄明州）不設夏令時間； 加拿大（不列顛哥倫比亞省（大部分））、墨西哥（下加利福尼亞州）、美國（加州、愛達荷州（北部）、內華達州（大部分）、俄勒岡州（大部分）、華盛頓州）設夏令時間
zh_tw: 加拿大（不列顛哥倫比亞省（東北部）、育空地區）、墨西哥（南下加利福尼亞州、納亞里特州（大部分）、錫那羅州、索諾拉州）、美國（亞利桑那州（大部分））； 加拿大（阿爾伯塔省、不列顛哥倫比亞省（東南部）、西北地區、努納武特（西部）、薩斯喀徹溫省（勞埃德明斯特地區））、墨西哥（奇瓦瓦州（西北邊境））、美國（亞利桑那州（納瓦霍族領地）、科羅拉多州、愛達荷州（大部分）、堪薩斯州（西部）、蒙大拿州、內布拉斯加州（西部）、新墨西哥州、內華達州（東北邊境）、北達科他州（西南部）、俄勒岡州（東部）、南達科他州（西部）、德克薩斯州（西部）、猶他州、懷俄明州）不實施夏令時； 加拿大（不列顛哥倫比亞省（大部分））、墨西哥（下加利福尼亞州）、美國（加利福尼亞州、愛達荷州（北部）、內華達州（大部分）、俄勒岡州（大部分）、華盛頓州）實施夏令時

# timeZone_neg0600
source: Belize, Canada (Saskatchewan (most)), Costa Rica, Ecuador (Galápagos), El Salvador, Guatemala, Honduras, Mexico (most), Nicaragua; Canada (Manitoba, Nunavut (central), Ontario (west)), Chile (Easter Island), Mexico (northeast border), United States (Alabama, Arkansas, Florida (northwest), Illinois, Indiana (northwest, southwest), Iowa, Kansas (most), Kentucky (west), Louisiana, Michigan (northwest border), Minnesota, Mississippi, Missouri, Nebraska (most), North Dakota (most), Oklahoma, South Dakota (most), Tennessee (most), Texas (most), Wisconsin) without DST; Canada (Alberta, British Columbia (southeast), Northwest Territories, Nunavut (west), Saskatchewan (Lloydminster area)), Mexico (Chihuahua (northwest border)), United States (Arizona (Navajo Nation), Colorado, Idaho (most), Kansas (west), Montana, Nebraska (west), New Mexico, Nevada (northeast border), North Dakota (southwest), Oregon (east), South Dakota (west), Texas (west), Utah, Wyoming) with DST
ar: بليز، كندا (ساسكاتشوان (معظمها))، كوستاريكا، الإكوادور (غالاباغوس)، السلفادور، غواتيمالا، هندوراس، المكسيك (معظمها)، نيكاراغوا؛ كندا (مانيتوبا، نونافوت (وسط)، أونتاريو (غرب))، تشيلي (جزيرة الفصح)، المكسيك (الحدود الشمالية الشرقية)، الولايات المتحدة (ألاباما، أركنساس، فلوريدا (شمال غرب)، إلينوي، إنديانا (شمال غرب، جنوب غرب)، آيوا، كانساس (معظمها)، كنتاكي (غرب)، لويزيانا، ميشيغان (الحدود الشمالية الغربية)، مينيسوتا، ميسيسيبي، ميسوري، نبراسكا (معظمها)، داكوتا الشمالية (معظمها)، أوكلاهوما، داكوتا الجنوبية (معظمها)، تينيسي (معظمها)، تكساس (معظمها)، ويسكونسن) بدون توقيت صيفي؛ كندا (ألبرتا، كولومبيا البريطانية (جنوب شرق)، الأقاليم الشمالية الغربية، نونافوت (غرب)، ساسكاتشوان (منطقة لويدمينيستر))، المكسيك (تشيواوا (الحدود الشمالية الغربية))، الولايات المتحدة (أريزونا (أمة نافاجو)، كولورادو، أيداهو (معظمها)، كانساس (غرب)، مونتانا، نبراسكا (غرب)، نيومكسيكو، نيفادا (الحدود الشمالية الشرقية)، داكوتا الشمالية (جنوب غرب)، أوريغون (شرق)، داكوتا الجنوبية (غرب)، تكساس (غرب)، يوتا، وايومنغ) مع توقيت صيفي
ja: ベリーズ、カナダ（サスカチュワン州（大部分））、コスタリカ、エクアドル（ガラパゴス諸島）、エルサルバドル、グアテマラ、ホンジュラス、メキシコ（大部分）、ニカラグア； カナダ（マニトバ州、ヌナブト準州（中部）、オンタリオ州（西部））、チリ（イースター島）、メキシコ（北東部国境）、アメリカ（アラバマ州、アーカンソー州、フロリダ州（北西部）、イリノイ州、インディアナ州（北西部・南西部）、 アイオワ州、カンザス州（大部分）、ケンタッキー州（西部）、ルイジアナ州、ミシガン州（北西部国境）、ミネソタ州、ミシシッピ州、ミズーリ州、ネブラスカ州（大部分）、ノースダコタ州（大部分）、オクラホマ州、サウスダコタ州（大部分）、テネシー州（大部分）、 テキサス州（大部分）、ウィスコンシン州）は夏時間を実施しない； カナダ（アルバータ州、ブリティッシュコロンビア州（南東部）、ノースウェスト準州、ヌナブト準州（西部）、サスカチュワン州（ロイドミンスター地域））、メキシコ（チワワ州（北西部国境））、アメリカ（アリゾナ州（ナバホ族居留地）、コロラド州、アイダホ州 （大部分）、カンザス州（西部）、モンタナ州、ネブラスカ州（西部）、ニューメキシコ州、ネバダ州（北東部国境）、ノースダコタ州（南西部）、オレゴン州（東部）、サウスダコタ州（西部）、テキサス州（西部）、ユタ州、ワイオミング州）は夏時間を実施
sv_se: Belize, Kanada (Saskatchewan (större delen)), Costa Rica, Ecuador (Galápagos), El Salvador, Guatemala, Honduras, Mexiko (större delen), Nicaragua; Kanada (Manitoba, Nunavut (centrala), Ontario (västra)), Chile (Påskön), Mexiko (nordöstra gränsen), USA (Alabama, Arkansas, Florida (nordvästra), Illinois, Indiana (nordväst, sydväst), Iowa, Kansas (större delen), Kentucky (västra), Louisiana, Michigan (nordvästra gränsen), Minnesota, Mississippi, Missouri, Nebraska (större delen), North Dakota (större delen), Oklahoma, South Dakota (större delen), Tennessee (större delen), Texas (större delen), Wisconsin) utan sommartid; Kanada (Alberta, British Columbia (sydost), Northwest Territories, Nunavut (västra), Saskatchewan (Lloydminsterområdet)), Mexiko (Chihuahua (nordvästra gränsen)), USA (Arizona (Navajo Nation), Colorado, Idaho (större delen), Kansas (västra), Montana, Nebraska (västra), New Mexico, Nevada (nordöstra gränsen), North Dakota (sydväst), Oregon (östra), South Dakota (västra), Texas (västra), Utah, Wyoming) med sommartid
zh_cn: 伯利兹、加拿大（萨斯喀彻温省（大部分））、哥斯达黎加、厄瓜多尔（加拉帕戈斯群岛）、萨尔瓦多、危地马拉、洪都拉斯、墨西哥（大部分）、尼加拉瓜； 加拿大（马尼托巴省、努纳武特（中部）、安大略省（西部））、智利（复活节岛）、墨西哥（东北边境）、美国（阿拉巴马州、阿肯色州、佛罗里达州（西北部）、伊利诺伊州、印第安纳州（西北部、西南部）、爱荷华州、堪萨斯州（大部分）、肯塔基州（西部）、路易斯安那州、密歇根州（西北边境）、明尼苏达州、密西西比州、密苏里州、内布拉斯加州（大部分）、北达科他州（大部分）、俄克拉荷马州、南达科他州（大部分）、田纳西州（大部分）、德克萨斯州（大部分）、威斯康星州）不实行夏令时； 加拿大（阿尔伯塔省、不列颠哥伦比亚省（东南部）、西北地区、努纳武特（西部）、萨斯喀彻温省（劳埃德明斯特地区））、墨西哥（奇瓦瓦州（西北边境））、美国（亚利桑那州（纳瓦霍族领地）、科罗拉多州、爱达荷州（大部分）、堪萨斯州（西部）、蒙大拿州、内布拉斯加州（西部）、新墨西哥州、内华达州（东北边境）、北达科他州（西南部）、俄勒冈州（东部）、南达科他州（西部）、德克萨斯州（西部）、犹他州、怀俄明州）实行夏令时
zh_hk: 伯利茲、加拿大（薩斯喀徹溫省（大部分））、哥斯達黎加、厄瓜多爾（加拉帕戈斯群島）、薩爾瓦多、危地馬拉、洪都拉斯、墨西哥（大部分）、尼加拉瓜； 加拿大（馬尼托巴省、努納武特（中部）、安大略省（西部））、智利（復活節島）、墨西哥（東北邊境）、美國（阿拉巴馬州、阿肯色州、佛羅里達州（西北部）、伊利諾伊州、印第安納州（西北部、西南部）、愛荷華州、堪薩斯州（大部分）、肯塔基州（西部）、路易斯安那州、密歇根州（西北邊境）、明尼蘇達州、密西西比州、密蘇里州、內布拉斯加州（大部分）、北達科他州（大部分）、奧克拉荷馬州、南達科他州（大部分）、田納西州（大部分）、德州（大部分）、威斯康辛州）不設夏令時間； 加拿大（阿爾伯塔省、不列顛哥倫比亞省（東南部）、西北地區、努納武特（西部）、薩斯喀徹溫省（勞埃德明斯特地區））、墨西哥（奇瓦瓦州（西北邊境））、美國（亞利桑那州（納瓦霍族地區）、科羅拉多州、愛達荷州（大部分）、堪薩斯州（西部）、蒙大拿州、內布拉斯加州（西部）、新墨西哥州、內華達州（東北邊境）、北達科他州（西南部）、俄勒岡州（東部）、南達科他州（西部）、德州（西部）、猶他州、懷俄明州）設夏令時間
zh_tw: 貝里斯、加拿大（薩斯喀徹溫省（大部分））、哥斯大黎加、厄瓜多（加拉巴哥群島）、薩爾瓦多、瓜地馬拉、宏都拉斯、墨西哥（大部分）、尼加拉瓜； 加拿大（馬尼托巴省、努納武特（中部）、安大略省（西部））、智利（復活節島）、墨西哥（東北邊境）、美國（阿拉巴馬州、阿肯色州、佛羅裡達州（西北）、伊利諾州、印第安納州（西北、西南部）、愛荷華州、堪薩斯州（大部分）、肯塔基州（西部）、路易斯安那州、密西根州（西北邊境）、明尼蘇達州、密西西比州、密蘇裡州、內布拉斯加州（大部分）、北達科他州（大部分）、奧克拉荷馬州、南達科他州（大部分）、田納西州（大部分）、德州（大部分）、威斯康辛州）不實施夏令時； 加拿大（阿爾伯塔省、不列顛哥倫比亞省（東南部）、西北地區、努納武特（西部）、薩斯喀徹溫省（勞埃德明斯特地區））、墨西哥（奇瓦瓦州（西北邊境））、美國（亞利桑那州（納瓦霍族領地）、科羅拉多州、愛達荷州（大部分）、堪薩斯州（西部）、蒙大拿州、內布拉斯加州（西部）、新墨西哥州、內華達州（東北邊境）、北達科他州（西南部）、俄勒岡州（東部）、南達科他州（西部）、德克薩斯州（西部）、猶他州、懷俄明州）實施夏令時

# timeZone_neg0500
source: Brazil (Acre, Amazonas (southwest)), Canada (Atikokan, Mishkeegogamang, Southampton Island), Cayman Islands, Colombia, Ecuador (most), Jamaica, Mexico (Quintana Roo), Navassa Island, Panama, Peru; Bahamas, Canada (Nunavut (east), Ontario (most), Quebec (most)), Cuba, Haiti, Turks and Caicos Islands, United States (Connecticut, Delaware, District of Columbia, Florida (most), Georgia, Indiana (most), Kentucky (east), Maine, Maryland, Massachusetts, Michigan (most), New Hampshire, New Jersey, New York, North Carolina, Ohio, Pennsylvania, Rhode Island, South Carolina, Tennessee (east), Vermont, Virginia, West Virginia) without DST; Canada (Manitoba, Nunavut (central), Ontario (west)), Chile (Easter Island), Mexico (northeast border), United States (Alabama, Arkansas, Florida (northwest), Illinois, Indiana (northwest, southwest), Iowa, Kansas (most), Kentucky (west), Louisiana, Michigan (northwest border), Minnesota, Mississippi, Missouri, Nebraska (most), North Dakota (most), Oklahoma, South Dakota (most), Tennessee (most), Texas (most), Wisconsin) with DST
ar: البرازيل (آكري، أمازوناس (جنوب غرب))، كندا (أتيكوكان، ميشكيجوغامانغ، جزيرة ساوثهامبتون)، جزر كايمان، كولومبيا، الإكوادور (معظمها)، جامايكا، المكسيك (كينتانا رو)، جزيرة نافاسا، بنما، بيرو؛ جزر البهاما، كندا (نونافوت (شرق)، أونتاريو (معظمها)، كيبيك (معظمها))، كوبا، هايتي، جزر توركس وكايكوس، الولايات المتحدة (كونيتيكت، ديلاوير، مقاطعة كولومبيا، فلوريدا (معظمها)، جورجيا، إنديانا (معظمها)، كنتاكي (شرق)، مين، ماريلاند، ماساتشوستس، ميشيغان (معظمها)، نيو هامبشاير، نيو جيرسي، نيويورك، كارولاينا الشمالية، أوهايو، بنسلفانيا، رود آيلاند، كارولاينا الجنوبية، تينيسي (شرق)، فيرمونت، فرجينيا، فرجينيا الغربية) بدون توقيت صيفي؛ كندا (مانيتوبا، نونافوت (وسط)، أونتاريو (غرب))، تشيلي (جزيرة الفصح)، المكسيك (الحدود الشمالية الشرقية)، الولايات المتحدة (ألاباما، أركنساس، فلوريدا (شمال غرب)، إلينوي، إنديانا (شمال غرب، جنوب غرب)، آيوا، كانساس (معظمها)، كنتاكي (غرب)، لويزيانا، ميشيغان (الحدود الشمالية الغربية)، مينيسوتا، ميسيسيبي، ميسوري، نبراسكا (معظمها)، داكوتا الشمالية (معظمها)، أوكلاهوما، داكوتا الجنوبية (معظمها)، تينيسي (معظمها)، تكساس (معظمها)، ويسكونسن) مع توقيت صيفي
ja: ブラジル（アクレ州、アマゾナス州（南西部））、カナダ（アティコカン、ミシキゴマン、サウスハンプトン島）、ケイマン諸島、コロンビア、エクアドル（大部分）、ジャマイカ、メキシコ（キンタナロー州）、ナバサ島、パナマ、ペルー； バハマ、カナダ（ヌナブト準州（東部）、オンタリオ州（大部分）、ケベック州（大部分））、キューバ、ハイチ、タークス・カイコス諸島、アメリカ（コネチカット州、デラウェア州、コロンビア特別区、フロリダ州（大部分）、 ジョージア州、インディアナ州（大部分）、ケンタッキー州（東部）、メイン州、メリーランド州、マサチューセッツ州、ミシガン州（大部分）、 ニューハンプシャー州、ニュージャージー州、ニューヨーク州、ノースカロライナ州、オハイオ州、ペンシルベニア州、ロードアイランド州、サウスカロライナ州、テネシー州（東部）、バーモント州、バージニア州、ウェストバージニア州）は夏時間を実施しない； カナダ（マニトバ州、ヌナブト準州（中部）、オンタリオ州（西部））、チリ（イースター島）、メキシコ（北東部国境）、アメリカ（アラバマ州、アーカンソー州、フロリダ州（北西部）、イリノイ州、インディアナ州（北西部・南西部）、 アイオワ州、カンザス州（大部分）、ケンタッキー州（西部）、ルイジアナ州、ミシガン州（北西部国境）、ミネソタ州、ミシシッピ州、ミズーリ州、ネブラスカ州（大部分）、ノースダコタ州（大部分）、オクラホマ州、サウスダコタ州（大部分）、 テネシー州（大部分）、テキサス州（大部分）、ウィスコンシン州）は夏時間を実施
sv_se: Brasilien (Acre, Amazonas (sydvästra)), Kanada (Atikokan, Mishkeegogamang, Southampton Island), Caymanöarna, Colombia, Ecuador (större delen), Jamaica, Mexiko (Quintana Roo), Navassaön, Panama, Peru; Bahamas, Kanada (Nunavut (östra), Ontario (större delen), Québec (större delen)), Kuba, Haiti, Turks- och Caicosöarna, USA (Connecticut, Delaware, District of Columbia, Florida (större delen), Georgia, Indiana (större delen), Kentucky (östra), Maine, Maryland, Massachusetts, Michigan (större delen), New Hampshire, New Jersey, New York, North Carolina, Ohio, Pennsylvania, Rhode Island, South Carolina, Tennessee (östra), Vermont, Virginia, West Virginia) utan sommartid; Kanada (Manitoba, Nunavut (centrala), Ontario (västra)), Chile (Påskön), Mexiko (nordöstra gränsen), USA (Alabama, Arkansas, Florida (nordvästra), Illinois, Indiana (nordväst, sydväst), Iowa, Kansas (större delen), Kentucky (västra), Louisiana, Michigan (nordvästra gränsen), Minnesota, Mississippi, Missouri, Nebraska (större delen), North Dakota (större delen), Oklahoma, South Dakota (större delen), Tennessee (större delen), Texas (större delen), Wisconsin) med sommartid
zh_cn: 巴西（阿克里州、亚马逊州（西南部））、加拿大（阿蒂科坎、米什基戈曼、南安普顿岛）、开曼群岛、哥伦比亚、厄瓜多尔（大部分地区）、牙买加、墨西哥（金塔纳罗奥州）、纳瓦萨岛、巴拿马、秘鲁； 巴哈马、加拿大（努纳武特（东部）、安大略省（大部分）、魁北克省（大部分））、古巴、海地、特克斯和凯科斯群岛、美国（康涅狄格州、特拉华州、哥伦比亚特区、佛罗里达州（大部分）、佐治亚州、印第安纳州（大部分）、肯塔基州（东部）、缅因州、马里兰州、马萨诸塞州、密歇根州（大部分）、新罕布什尔州、新泽西州、纽约州、北卡罗来纳州、俄亥俄州、宾夕法尼亚州、罗德岛州、南卡罗来纳州、田纳西州（东部）、佛蒙特州、弗吉尼亚州、西弗吉尼亚州）不实行夏令时； 加拿大（马尼托巴省、努纳武特地区（中部）、安大略省（西部））、智利（复活节岛）、墨西哥（东北边境）、美国（阿拉巴马州、阿肯色州、佛罗里达州（西北部）、伊利诺伊州、印第安纳州（西北部、西南部）、爱荷华州、堪萨斯州（大部分）、肯塔基州（西部）、路易斯安那州、密歇根州（西北边境）、明尼苏达州、密西西比州、密苏里州、内布拉斯加州（大部分）、北达科他州（大部分）、俄克拉荷马州、南达科他州（大部分）、田纳西州（大部分）、德克萨斯州（大部分）、威斯康星州）实行夏令时
zh_hk: 巴西（阿克里州、亞馬遜州（西南部））、加拿大（阿提科坎、米希基戈加曼、南安普敦島）、開曼群島、哥倫比亞、厄瓜多爾（大部分）、牙買加、墨西哥（金塔納羅奧州）、納瓦薩島、巴拿馬、秘魯； 巴哈馬、加拿大（努納武特（東部）、安大略省（大部分）、魁北克省（大部分））、古巴、海地、特克斯和凱科斯群島、美國（康涅狄格州、特拉華州、哥倫比亞特區、佛羅里達州（大部分）、佐治亞州、印第安納州（大部分）、肯塔基州（東部）、緬因州、馬里蘭州、麻省、密歇根州（大部分）、新罕布什爾州、新澤西州、紐約州、北卡羅來納州、俄亥俄州、賓夕法尼亞州、羅德島州、南卡羅來納州、田納西州（東部）、佛蒙特州、維珍尼亞州、西維珍尼亞州）不設夏令時間； 加拿大（馬尼托巴省、努納武特（中部）、安大略省（西部））、智利（復活節島）、墨西哥（東北邊境）、美國（阿拉巴馬州、阿肯色州、佛羅里達州（西北部）、伊利諾伊州、印第安納州（西北部、西南部）、愛荷華州、堪薩斯州（大部分）、肯塔基州（西部）、路易斯安那州、密歇根州（西北邊境）、明尼蘇達州、密西西比州、密蘇里州、內布拉斯加州（大部分）、北達科他州（大部分）、奧克拉荷馬州、南達科他州（大部分）、田納西州（大部分）、德州（大部分）、威斯康辛州）設夏令時間
zh_tw: 巴西（阿克里州、亞馬遜州（西南部））、加拿大（阿蒂科坎、米甚基戈曼、南安普敦島）、開曼群島、哥倫比亞、厄瓜多（大部分地區）、牙買加、墨西哥（金塔納羅奧州）、納瓦薩島、巴拿馬、秘魯； 巴哈馬、加拿大（努納武特（東部）、安大略省（大部分）、魁北克省（大部分））、古巴、海地、特克斯和凱科斯群島、美國（康乃狄克州、德拉瓦州、哥倫比亞特區、佛羅裡達州（大部分）、喬治亞州、印第安納州（大部分）、肯塔基州（東部）、緬因州、馬裡蘭州、麻薩諸塞州、密西根州（大部分）、新罕布夏州、紐澤西州、紐約州、北卡羅萊納州、俄亥俄州、賓州、羅德島州、南卡羅來納州、田納西州（東部）、佛蒙特州、維吉尼亞州、西維吉尼亞州）不實施夏令時； 加拿大（馬尼托巴省、努納武特地區（中部）、安大略省（西部））、智利（復活節島）、墨西哥（東北邊境）、美國（阿拉巴馬州、阿肯色州、佛羅裡達州（西北）、伊利諾州、印第安納州（西北、西南部）、愛荷華州、堪薩斯州（大部分）、肯塔基州（西部）、路易斯安那州、密西根州（西北邊境）、明尼蘇達州、密西西比州、密蘇裡州、內布拉斯加州（大部分）、北達科他州（大部分）、奧克拉荷馬州、南達科他州（大部分）、田納西州（大部分）、德州（大部分）、威斯康辛州）實施夏令時
