Repository: Ace-tyl/DaysCounter2
Catalog: Lang/Resources.*.resx
Languages: ar, ja, sv_se, zh_cn, zh_hk, zh_tw

# timeZone_neg0400
source: Anguilla, Antigua and Barbuda, Aruba, Barbados, Bolivia, Brazil (Amazonas (most), Mato Grosso, Mato Grosso do Sul, Rondônia, Roraima), British Virgin Islands, Canada (Quebec (east)), Caribbean Netherlands, Curaçao, Dominica, Dominican Republic, Grenada, Guadeloupe, Guyana, Martinique, Montserrat, Puerto Rico, Saint Barthélemy, Saint Kitts and Nevis, Saint Lucia, Saint Martin, Saint Vincent and the Grenadines, Sint Maarten, Trinidad and Tobago, U.S. Virgin Islands, Venezuela; Bermuda, Canada (Labrador (most), New Brunswick, Nova Scotia, Prince Edward Island), Chile (most), Greenland (Pituffik Space Base) without DST; Bahamas, Canada (Nunavut (east), Ontario (most), Quebec (most)), Cuba, Haiti, Turks and Caicos Islands, United States (Connecticut, Delaware, District of Columbia, Florida (most), Georgia, Indiana (most), Kentucky (east), Maine, Maryland, Massachusetts, Michigan (most), New Hampshire, New Jersey, New York, North Carolina, Ohio, Pennsylvania, Rhode Island, South Carolina, Tennessee (east), Vermont, Virginia, West Virginia) with DST
ar: أنغويلا، أنتيغوا وباربودا، أروبا، بربادوس، بوليفيا، البرازيل (أمازوناس (معظمها)، ماتو جروسو، ماتو جروسو دو سول، روندونيا، رورايما)، جزر العذراء البريطانية، كندا (كيبيك (شرق))، جزر الكاريبي الهولندية، كوراساو، دومينيكا، جمهورية الدومينيكان، غرينادا، غوادلوب، غيانا، مارتينيك، مونتسرات، بورتوريكو، سان بارتيلمي، سانت كيتس ونيفيس، سانت لوسيا، سانت مارتن، سانت فينسنت والغرينادين، سانت مارتن، ترينيداد وتوباغو، جزر العذراء الأمريكية، فنزويلا؛ برمودا، كندا (لابرادور (معظمها))، نيو برونزويك، نوفا سكوشا، جزيرة الأمير إدوارد)، تشيلي (معظمها)، جرينلاند (قاعدة بيتوفيك الفضائية) بدون توقيت صيفي؛ جزر البهاما، كندا (نونافوت (شرق)، أونتاريو (معظمها)، كيبيك (معظمها))، كوبا، هايتي، جزر توركس وكايكوس، الولايات المتحدة (كونيتيكت، ديلاوير، مقاطعة كولومبيا، فلوريدا (معظمها)، جورجيا، إنديانا (معظمها)، كنتاكي (شرق)، مين، ماريلاند، ماساتشوستس، ميشيغان (معظمها)، نيو هامبشاير، نيو جيرسي، نيويورك، كارولاينا الشمالية، أوهايو، بنسلفانيا، رود آيلاند، كارولاينا الجنوبية، تينيسي (شرق)، فيرمونت، فرجينيا، فرجينيا الغربية) مع توقيت صيفي
ja: アンギラ、アンティグア・バーブーダ、アルバ、バルバドス、ボリビア、ブラジル（アマゾナス州（大部分）、マットグロッソ州、マットグロッソ・ド・スル州、ロンドニア州、ロライマ州）、 イギリス領ヴァージン諸島、カナダ（ケベック州（東部））、カリブオランダ、キュラソー島、ドミニカ、ドミニカ共和国、グレナダ、グアドループ島、 ガイアナ、マルティニーク島、モントセラト島、プエルトリコ、サン・バルテルミー島、セントキッツ・ネビス、セントルシア、セント・マーチン島、セントビンセント・グレナディーン諸島、セント・マーチン島、トリニダード・トバゴ、米領バージン諸島、ベネズエラ； バミューダ諸島、カナダ（ラブラドール州（大部分）、ニューブランズウィック州、ノバスコシア州、プリンスエドワード島）、チリ（大部分）、グリーンランド（ピトゥフィーク宇宙基地）は夏時間を実施しない； バハマ、カナダ（ヌナブト準州（東部）、オンタリオ州（大部分）、 ケベック州（大部分））、キューバ、ハイチ、タークス・カイコス諸島、アメリカ（コネチカット州、デラウェア州、コロンビア特別区、フロリダ州（大部分）、ジョージア州、インディアナ州（大部分）、ケンタッキー州（東部）、メイン州、 メリーランド州、マサチューセッツ州、ミシガン州（大部分）、ニューハンプシャー州、ニュージャージー州、ニューヨーク州、ノースカロライナ州、オハイオ州、ペンシルベニア州、ロードアイランド州、サウスカロライナ州、テネシー州（東部）、バーモント州、バージニア州、ウェストバージニア州）は夏時間を実施
sv_se: Anguilla, Antigua och Barbuda, Aruba, Barbados, Bolivia, Brasilien (Amazonas (större delen), Mato Grosso, Mato Grosso do Sul, Rondônia, Roraima), Brittiska Jungfruöarna, Kanada (Québec (östra)), Karibiska Nederländerna, Curaçao, Dominica, Dominikanska republiken, Grenada, Guadeloupe, Guyana, Martinique, Montserrat, Puerto Rico, Saint-Barthélemy, Saint Kitts och Nevis, Saint Lucia, Saint Martin, Saint Vincent och Grenadinerna, Sint Maarten, Trinidad och Tobago, Amerikanska Jungfruöarna, Venezuela; Bermuda, Kanada (Labrador (större delen), New Brunswick, Nova Scotia, Prince Edward Island), Chile (större delen), Grönland (Pituffik Space Base) utan sommartid; Bahamas, Kanada (Nunavut (östra), Ontario (större delen), Québec (större delen)), Kuba, Haiti, Turks- och Caicosöarna, USA (Connecticut, Delaware, District of Columbia, Florida (större delen), Georgia, Indiana (större delen), Kentucky (östra), Maine, Maryland, Massachusetts, Michigan (större delen), New Hampshire, New Jersey, New York, North Carolina, Ohio, Pennsylvania, Rhode Island, South Carolina, Tennessee (östra), Vermont, Virginia, West Virginia) med sommartid
zh_cn: 安圭拉、安提瓜和巴布达、阿鲁巴、巴巴多斯、玻利维亚、巴西（亚马孙州（大部分）、马托格罗索州、南马托格罗索州、朗多尼亚州、罗赖马州）、英属维尔京群岛、加拿大（魁北克省（东部））、加勒比荷兰、库拉索岛、多米尼克、多米尼加共和国、格林纳达、瓜德罗普岛、圭亚那、马提尼克岛、蒙特塞拉特岛、波多黎各、圣巴泰勒米岛、圣基茨和尼维斯、圣卢西亚、圣马丁岛、圣文森特和格林纳丁斯、圣马丁岛、特立尼达和多巴哥、美属维尔京群岛、委内瑞拉； 百慕大群岛、加拿大（拉布拉多省（大部分）、新不伦瑞克省、新斯科舍省、爱德华王子岛）、智利（大部分）、格陵兰岛（皮图菲克太空基地）不实行夏令时； 巴哈马、加拿大（努纳武特（东部）、安大略省（大部分）、魁北克省（大部分））、古巴、海地、特克斯和凯科斯群岛、美国（康涅狄格州、特拉华州、哥伦比亚特区、佛罗里达州（大部分）、佐治亚州、印第安纳州（大部分）、肯塔基州（东部）、缅因州、马里兰州、马萨诸塞州、密歇根州（大部分）、新罕布什尔州、新泽西州、纽约州、北卡罗来纳州、俄亥俄州、宾夕法尼亚州、罗德岛州、南卡罗来纳州、田纳西州（东部）、佛蒙特州、弗吉尼亚州、西弗吉尼亚州）实行夏令时
zh_hk: 安圭拉、安提瓜和巴布達、阿魯巴、巴巴多斯、玻利維亞、巴西（亞馬遜州（大部分）、馬托格羅索州、南馬托格羅索州、朗多尼亞州、羅賴馬州）、英屬維京群島、加拿大（魁北克省（東部））、加勒比荷蘭、庫拉索、多米尼克、多米尼加共和國、格林納達、瓜德羅普、圭亞那、馬提尼克、蒙特塞拉特、波多黎各、聖巴泰勒米、聖基茨和尼維斯、聖盧西亞、聖馬丁、聖文森特和格林納丁斯、荷屬聖馬丁、千里達和多巴哥、美屬維京群島、委內瑞拉； 百慕達、加拿大（拉布拉多（大部分）、新不倫瑞克省、新斯科舍省、愛德華王子島）、智利（大部分）、格陵蘭（皮圖菲克太空基地）不設夏令時間； 巴哈馬、加拿大（努納武特（東部）、安大略省（大部分）、魁北克省（大部分））、古巴、海地、特克斯和凱科斯群島、美國（康涅狄格州、特拉華州、哥倫比亞特區、佛羅里達州（大部分）、佐治亞州、印第安納州（大部分）、肯塔基州（東部）、緬因州、馬里蘭州、麻省、密歇根州（大部分）、新罕布什爾州、新澤西州、紐約州、北卡羅來納州、俄亥俄州、賓夕法尼亞州、羅德島州、南卡羅來納州、田納西州（東部）、佛蒙特州、維珍尼亞州、西維珍尼亞州）設夏令時間
zh_tw: 安圭拉、安提瓜和巴布達、阿魯巴、巴貝多、玻利維亞、巴西（亞馬孫州（大部分）、馬托格羅索州、南馬托格羅索州、朗多尼亞州、羅賴馬州）、英屬維京群島、加拿大（魁北克省（東部））、加勒比海荷蘭、庫拉索島、多明尼克、多明尼加共和國、格瑞那達、瓜德羅普島、圭亞那、馬提尼克島、蒙特塞拉特島、波多黎各、聖巴泰勒米島、聖基茨和尼維斯、聖露西亞、聖馬丁島、聖文森和格林納丁斯、聖馬丁島、特立尼達和多巴哥、美屬維爾京群島、委內瑞拉； 百慕達群島、加拿大（拉布拉多省（大部分）、新不倫瑞克省、新斯科細亞省、愛德華王子島）、智利（大部分）、格陵蘭（皮圖菲克太空基地）不實施夏令時； 巴哈馬、加拿大（努納武特（東部）、安大略省（大部分）、魁北克省（大部分））、古巴、海地、特克斯和凱科斯群島、美國（康乃狄克州、德拉瓦州、哥倫比亞特區、佛羅裡達州（大部分）、喬治亞州、印第安納州（大部分）、肯塔基州（東部）、緬因州、馬裡蘭州、麻薩諸塞州、密西根州（大部分）、新罕布夏州、紐澤西州、紐約州、北卡羅萊納州、俄亥俄州、賓州、羅德島州、南卡羅來納州、田納西州（東部）、佛蒙特州、維吉尼亞州、西維吉尼亞州）實施夏令時

# timeZone_neg0330
source: Canada (Newfoundland, Labrador (southeast)) without DST
ar: كندا (نيوفاوندلاند، لابرادور (جنوب شرق)) بدون توقيت صيفي
ja: カナダ（ニューファンドランド、ラブラドール（南東部））は夏時間を実施しない
sv_se: Kanada (Newfoundland, Labrador (sydost)) utan sommartid
zh_cn: 加拿大（纽芬兰、拉布拉多（东南部））不实行夏令时
zh_hk: 加拿大（紐芬蘭、拉布拉多（東南部））不設夏令時間
zh_tw: 加拿大（紐芬蘭、拉布拉多（東南部））不實施夏令時

# timeZone_neg0300
source: Argentina, Brazil (most), Chile (Aysén, Magallanes), Falkland Islands, French Guiana, Paraguay, Suriname, Uruguay; Saint Pierre and Miquelon without DST; Bermuda, Canada (Labrador (most), New Brunswick, Nova Scotia, Prince Edward Island), Chile (most), Greenland (Pituffik Space Base) with DST
ar: الأرجنتين، البرازيل (معظمها)، تشيلي (آيسين، ماجلان)، جزر فوكلاند، غويانا الفرنسية، باراغواي، سورينام، أوروغواي؛ سان بيير وميكلون بدون توقيت صيفي؛ برمودا، كندا (لابرادور (معظمها))، نيو برونزويك، نوفا سكوشا، جزيرة الأمير إدوارد)، تشيلي (معظمها)، جرينلاند (قاعدة بيتوفيك الفضائية) مع توقيت صيفي
ja: アルゼンチン、ブラジル（大部分）、チリ（アイゼン、マゼラン）、フォークランド諸島、フランス領ギアナ、パラグアイ、スリナム、ウルグアイ； サンピエール・ミクロン島は夏時間を実施しない； バミューダ諸島、カナダ（ラブラドール州（大部分）、ニューブランズウィック州、ノバスコシア州、プリンスエドワード島）、チリ（大部分）、グリーンランド（ピトゥフィーク宇宙基地）は夏時間を実施
sv_se: Argentina, Brasilien (större delen), Chile (Aysén, Magallanes), Falklandsöarna, Franska Guyana, Paraguay, Surinam, Uruguay; Saint-Pierre och Miquelon utan sommartid; Bermuda, Kanada (Labrador (större delen), New Brunswick, Nova Scotia, Prince Edward Island), Chile (större delen), Grönland (Pituffik Space Base) med sommartid
zh_cn: 阿根廷、巴西（大部分地区）、智利（艾森、麦哲伦）、福克兰群岛、法属圭亚那、巴拉圭、苏里南、乌拉圭； 圣皮埃尔和密克隆岛不实行夏令时； 百慕大群岛、加拿大（拉布拉多省（大部分地区）、新不伦瑞克省、新斯科舍省、爱德华王子岛）、智利（大部分地区）、格陵兰岛（皮图菲克太空基地）实行夏令时
zh_hk: 阿根廷、巴西（大部分）、智利（艾森、麥哲倫）、福克蘭群島、法屬圭亞那、巴拉圭、蘇里南、烏拉圭； 聖皮埃爾和密克隆群島不設夏令時間； 百慕達、加拿大（拉布拉多（大部分）、新不倫瑞克省、新斯科舍省、愛德華王子島）、智利（大部分）、格陵蘭（皮圖菲克太空基地）設夏令時間
zh_tw: 阿根廷、巴西（大部分地區）、智利（艾森、麥哲倫）、福克蘭群島、法國圭亞那、巴拉圭、蘇利南、烏拉圭； 聖皮埃爾和密克隆島不實施夏令時； 百慕達群島、加拿大（拉布拉多省（大部分地區）、新不倫瑞克省、新斯科細亞省、愛德華王子島）、智利（大部分地區）、格陵蘭（皮圖菲克太空基地）實施夏令時

# timeZone_neg0230
source: Canada (Newfoundland, Labrador (southeast)) with DST
ar: كندا (نيوفاوندلاند، لابرادور (جنوب شرق)) مع توقيت صيفي
ja: カナダ（ニューファンドランド、ラブラドール（南東部））は夏時間を実施
sv_se: Kanada (Newfoundland, Labrador (sydost)) med sommartid
zh_cn: 加拿大（纽芬兰、拉布拉多（东南部））实行夏令时
zh_hk: 加拿大（紐芬蘭、拉布拉多（東南部））設夏令時間
zh_tw: 加拿大（紐芬蘭、拉布拉多（東南部））實施夏令時

# timeZone_neg0200
source: Brazil (Fernando de Noronha), South Georgia and the South Sandwich Islands; Greenland (most) without DST; Saint Pierre and Miquelon with DST
ar: البرازيل (أرخبيل فرناندو دي نورونها)، جورجيا الجنوبية وجزر ساندويتش الجنوبية؛ جرينلاند (معظمها) بدون توقيت صيفي؛ سان بيير وميكلون مع توقيت صيفي
ja: ブラジル（フェルナンド・ディノローニャ諸島）、サウスジョージア島およびサウスサンドウィッチ諸島； グリーンランド（大部分）は夏時間を実施しない； サンピエール・ミクロン諸島は夏時間を実施
sv_se: Brasilien (Fernando de Noronha), South Georgia och South Sandwichöarna; Grönland (större delen) utan sommartid; Saint-Pierre och Miquelon med sommartid
zh_cn: 巴西（费尔南多·迪诺罗尼亚群岛）、南乔治亚岛和南桑威奇群岛； 格陵兰岛（大部分地区）不实行夏令时； 圣皮埃尔和密克隆岛实行夏令时
zh_hk: 巴西（費爾南多·迪諾羅尼亞）、南佐治亞島及南桑威奇群島； 格陵蘭（大部分）不設夏令時間； 聖皮埃爾和密克隆群島設夏令時間
zh_tw: 巴西（費爾南多·迪諾羅尼亞群島）、南喬治亞島和南桑威奇群島； 格陵蘭島（大部分地區）不實施夏令時； 聖皮埃爾和密克隆島實施夏令時

# timeZone_neg0100
source: Cape Verde; Portugal (Azores) without DST; Greenland (most) with DST
ar: الرأس الأخضر؛ البرتغال (جزر الأزور) بدون توقيت صيفي؛ جرينلاند (معظمها) مع توقيت صيفي
ja: カーボベルデ； ポルトガル（アゾレス諸島）は夏時間を実施しない； グリーンランド（大部分）は夏時間を実施
sv_se: Kap Verde; Portugal (Azorerna) utan sommartid; Grönland (större delen) med sommartid
zh_cn: 佛得角； 葡萄牙（亚速尔群岛）不实行夏令时； 格陵兰岛（大部分地区）实行夏令时
zh_hk: 佛得角； 葡萄牙（亞速爾群島）不設夏令時間； 格陵蘭（大部分）設夏令時間
zh_tw: 維德角; 葡萄牙（亞速爾群島）不實施夏令時； 格陵蘭島（大部分地區）實施夏令時

# timeZone_pos0000
source: Burkina Faso, Gambia, Ghana, Greenland (National Park (east coast)), Guinea, Guinea-Bissau, Iceland, Ivory Coast, Liberia, Mali, Mauritania, Saint Helena, Ascension and Tristan da Cunha, Senegal, Sierra Leone, São Tomé and Príncipe, Togo; Faroe Islands, Guernsey, Ireland, Isle of Man, Jersey, Portugal (most), Spain (Canary Islands), United Kingdom without DST; Portugal (Azores) with DST
ar: بوركينا فاسو، غامبيا، غانا، جرينلاند (المتنزه الوطني (الساحل الشرقي))، غينيا، غينيا بيساو، آيسلندا، ساحل العاج، ليبيريا، مالي، موريتانيا، سانت هيلينا، أسنشن وتريستان دا كونا، السنغال، سيراليون، ساو تومي وبرينسيب، توغو؛ جزر فارو، غيرنزي، أيرلندا، جزيرة مان، جيرزي، البرتغال (معظمها)، إسبانيا (جزر الكناري)، المملكة المتحدة بدون توقيت صيفي؛ البرتغال (جزر الأزور) مع توقيت صيفي
ja: ブルキナファソ、ガンビア、ガーナ、グリーンランド（東海岸国立公園）、ギニア、ギニアビサウ、アイスランド、コートジボワール、リベリア、マリ、モーリタニア、セントヘレナ、アセンション島およびトリスタン・ダ・クーニャ、セネガル、シエラレオネ、サントメ・プリンシペ、トーゴ； フェロー諸島、ガーンジー島、アイルランド、マン島、ジャージー島、ポルトガル（大部分）、スペイン（カナリア諸島）、イギリスは夏時間を実施しない； ポルトガル（アゾレス諸島）は夏時間を実施
sv_se: Burkina Faso, Gambia, Ghana, Grönland (Nationalparken (ostkusten)), Guinea, Guinea-Bissau, Island, Elfenbenskusten, Liberia, Mali, Mauretanien, Sankta Helena, Ascension och Tristan da Cunha, Senegal, Sierra Leone, São Tomé och Príncipe, Togo; Färöarna, Guernsey, Irland, Isle of Man, Jersey, Portugal (större delen), Spanien (Kanarieöarna), Storbritannien utan sommartid; Portugal (Azorerna) med sommartid
zh_cn: 布基纳法索、冈比亚、加纳、格陵兰（东海岸国家公园）、几内亚、几内亚比绍、冰岛、科特迪瓦、利比里亚、马里、毛里塔尼亚、圣赫勒拿、阿森松和特里斯坦-达库尼亚、塞内加尔、塞拉利昂、圣多美和普林西比、多哥； 法罗群岛、根西岛、爱尔兰、马恩岛、泽西岛、葡萄牙（大部分地区）、西班牙（加那利群岛）、英国不实行夏令时； 葡萄牙（亚速尔群岛）实行夏令时
zh_hk: 布基納法索、岡比亞、加納、格陵蘭（國家公園（東岸））、幾內亞、幾內亞比紹、冰島、科特迪瓦、利比里亞、馬里、毛里塔尼亞、聖赫勒拿、阿森松島及特里斯坦-達庫尼亞、塞內加爾、塞拉利昂、聖多美和普林西比、多哥； 法羅群島、根西、愛爾蘭、曼島、澤西、葡萄牙（大部分）、西班牙（加那利群島）、英國不設夏令時間； 葡萄牙（亞速爾群島）設夏令時間
zh_tw: 布吉納法索、甘比亞、加納、格陵蘭（東海岸國家公園）、幾內亞、幾內亞比紹、冰島、科特迪瓦、賴比瑞亞、馬利、茅利塔尼亞、聖赫勒拿、阿森松和特里斯坦-達庫尼亞、塞內加爾、塞拉利昂、聖多哥和普林西比、多哥； 法羅群島、根西島、愛爾蘭、馬恩島、澤西島、葡萄牙（大部分地區）、西班牙（加那利群島）、英國不實施夏令時； 葡萄牙（亞速爾群島）實施夏令時

# timeZone_pos0048
source: Kindom of Elleore without DST
ar: مملكة إلليور بدون توقيت صيفي
ja: エリオリ王国は夏時間を実施しない
sv_se: Kungariket Elleore utan sommartid
zh_cn: 艾里欧里王国不实行夏令时
zh_hk: 埃勒歐雷王國不設夏令時間
zh_tw: 艾里奧裡王國不實施夏令時

# timeZone_pos0100
source: Algeria, Angola, Benin, Cameroon, Central African Republic, Chad, Congo, DR Congo (Équateur, Kinshasa, Kongo Central, Kwango, Kwilu, Mai-Ndombe, Mongala, Nord-Ubangi, Sud-Ubangi, Tshuapa), Equatorial Guinea, Gabon, Morocco, Niger, Nigeria, Tunisia; Albania, Andorra, Austria, Belgium, Bosnia and Herzegovina, Croatia, Czech Republic, Denmark, France (metropolitan), Germany, Gibraltar, Hungary, Italy, Liechtenstein, Luxembourg, Malta, Monaco, Montenegro, Netherlands (European), North Macedonia, Norway, Poland, San Marino, Serbia, Slovakia, Slovenia, Spain (most), Sweden, Switzerland, Vatican City without DST; Faroe Islands, Guernsey, Ireland, Isle of Man, Jersey, Portugal (most), Spain (Canary Islands), United Kingdom with DST
ar: الجزائر، أنغولا، بنين، الكاميرون، جمهورية أفريقيا الوسطى، تشاد، الكونغو، جمهورية الكونغو الديمقراطية (إكواتور، كينشاسا، كونغو الوسطى، كوانغو، كويلو، ماي-ندومبي، مونغالا، شمال أوبانغي، جنوب أوبانغي، تشوابا)، غينيا الاستوائية، الغابون، المغرب، النيجر، نيجيريا، تونس؛ ألبانيا، أندورا، النمسا، بلجيكا، البوسنة والهرسك، كرواتيا، جمهورية التشيك، الدنمارك، فرنسا (العاصمة)، ألمانيا، جبل طارق، المجر، إيطاليا، ليختنشتاين، لوكسمبورغ، مالطا، موناكو، الجبل الأسود، هولندا (أوروبا)، مقدونيا الشمالية، النرويج، بولندا، سان مارينو، صربيا، سلوفاكيا، سلوفينيا، إسبانيا (معظمها)، السويد، سويسرا، مدينة الفاتيكان بدون توقيت صيفي؛ جزر فارو، غيرنزي، أيرلندا، جزيرة مان، جيرزي، البرتغال (معظمها)، إسبانيا (جزر الكناري)، المملكة المتحدة مع توقيت صيفي
ja: アルジェリア、アンゴラ、ベナン、カメルーン、中央アフリカ共和国、チャド、コンゴ、コンゴ民主共和国（赤道州、キンシャサ、中コンゴ州、カンゴ州、ケルー州、マイ＝ンドムベ州、モンガラ州、北ウバンギ・シャリ州、南ウバンギ・シャリ州、チュアパ州）、 赤道ギニア、ガボン、モロッコ、ニジェール、ナイジェリア、チュニジア； アルバニア、アンドラ、オーストリア、ベルギー、ボスニア・ヘルツェゴビナ、クロアチア、チェコ共和国、デンマーク、フランス（本土）、ドイツ、ジブラルタル、 ハンガリー、イタリア、リヒテンシュタイン、ルクセンブルク、マルタ、モナコ、モンテネグロ、オランダ（欧州標準時）、北マケドニア、ノルウェー、ポーランド、サンマリノ、セルビア、スロバキア、スロベニア、スペイン（大部分）、スウェーデン、スイス、バチカン市国は夏時間を実施しない； フェロー諸島、ガーンジー島、アイルランド、マン島、ジャージー島、ポルトガル（大部分）、スペイン（カナリア諸島）、イギリスは夏時間を実施
sv_se: Algeriet, Angola, Benin, Kamerun, Centralafrikanska republiken, Tchad, Kongo, DR Kongo (Équateur, Kinshasa, Kongo Central, Kwango, Kwilu, Mai-Ndombe, Mongala, Nord-Ubangi, Sud-Ubangi, Tshuapa), Ekvatorialguinea, Gabon, Marocko, Niger, Nigeria, Tunisien; Albanien, Andorra, Österrike, Belgien, Bosnien och Hercegovina, Kroatien, Tjeckien, Danmark, Frankrike (metropolitan), Tyskland, Gibraltar, Ungern, Italien, Liechtenstein, Luxemburg, Malta, Monaco, Montenegro, Nederländerna (europeiska), Nordmakedonien, Norge, Polen, San Marino, Serbien, Slovakien, Slovenien, Spanien (större delen), Sverige, Schweiz, Vatikanstaten utan sommartid; Färöarna, Guernsey, Irland, Isle of Man, Jersey, Portugal (större delen), Spanien (Kanarieöarna), Storbritannien med sommartid
zh_cn: 阿尔及利亚、安哥拉、贝宁、喀麦隆、中非共和国、乍得、刚果、刚果民主共和国（赤道省、金沙萨、中刚果省、宽果省、奎卢省、马伊-恩多姆贝省、蒙加拉省、北乌班吉沙立省、南乌班吉沙立省、楚阿帕省）、赤道几内亚、加蓬、摩洛哥、尼日尔、尼日利亚、突尼斯； 阿尔巴尼亚、安道尔、奥地利、比利时、波斯尼亚和黑塞哥维那、克罗地亚、捷克共和国、丹麦、法国（本土）、德国、直布罗陀、匈牙利、意大利、列支敦士登、卢森堡、马耳他、摩纳哥、黑山、荷兰（欧洲标准时间）、北马其顿、挪威、波兰、圣马力诺、塞尔维亚、斯洛伐克、斯洛文尼亚、西班牙（大部分地区）、瑞典、瑞士、梵蒂冈不实行夏令时； 法罗群岛、根西岛、爱尔兰、马恩岛、泽西岛、葡萄牙（大部分地区）、西班牙（加那利群岛）、英国实行夏令时
zh_hk: 阿爾及利亞、安哥拉、貝寧、喀麥隆、中非共和國、乍得、剛果、剛果民主共和國（赤道省、金沙薩、剛果中央省、寬戈省、奎盧省、邁恩東貝省、蒙加拉省、北烏班吉省、南烏班吉省、楚阿帕省）、赤道幾內亞、加蓬、摩洛哥、尼日爾、尼日利亞、突尼西亞； 阿爾巴尼亞、安道爾、奧地利、比利時、波斯尼亞和黑塞哥維那、克羅地亞、捷克、丹麥、法國（本土）、德國、直布羅陀、匈牙利、意大利、列支敦士登、盧森堡、馬耳他、摩納哥、黑山、荷蘭（歐洲部分）、北馬其頓、挪威、波蘭、聖馬力諾、塞爾維亞、斯洛伐克、斯洛文尼亞、西班牙（大部分）、瑞典、瑞士、梵蒂岡城不設夏令時間； 法羅群島、根西、愛爾蘭、曼島、澤西、葡萄牙（大部分）、西班牙（加那利群島）、英國設夏令時間
zh_tw: 阿爾及利亞、安哥拉、貝南、喀麥隆、中非共和國、查德、剛果、剛果民主共和國（赤道省、金沙薩、中剛果省、寬果省、奎盧省、馬伊-恩多姆貝省、蒙加拉省、北烏班吉沙立省、南烏班吉沙立省、亞阿帕亞省）、赤道幾內亞、加彭、摩洛哥、尼日、奈及利亞、突尼西亞； 阿爾巴尼亞、安道爾、奧地利、比利時、波士尼亞和赫塞哥維納、克羅埃西亞、捷克、丹麥、法國（本土）、德國、直布羅陀、匈牙利、義大利、列支敦士登、盧森堡、馬耳他他、摩納哥、蒙特內哥羅、荷蘭（歐洲標準時間）、北馬其頓、挪威、波蘭、聖馬利諾、塞爾維亞、斯洛伐克、斯洛維尼亞、西班牙（大部分地區）、瑞典、瑞士、梵蒂岡不實施夏令時； 法羅群島、根西島、愛爾蘭、馬恩島、澤西島、葡萄牙（大部分地區）、西班牙（加那利群島）、英國實施夏令時

# timeZone_pos0148
source: Kindom of Elleore with DST
ar: مملكة إلليور مع توقيت صيفي
ja: エリオリ王国は夏時間を実施
sv_se: Kungariket Elleore med sommartid
zh_cn: 艾里欧里王国实行夏令时
zh_hk: 埃勒歐雷王國設夏令時間
zh_tw: 艾里奧裡王國實施夏令時

# timeZone_pos0200
source: Botswana, Burundi, DR Congo (most), Eswatini, Lesotho, Libya, Malawi, Mozambique, Namibia, Russia (Kaliningrad), Rwanda, South Africa (most), South Sudan, Sudan, Zambia, Zimbabwe; Akrotiri and Dhekelia, Bulgaria, Cyprus, Egypt, Estonia, Finland, Greece, Israel, Latvia, Lebanon, Lithuania, Moldova, Palestine, Romania, Ukraine (most) without DST; Albania, Andorra, Austria, Belgium, Bosnia and Herzegovina, Croatia, Czech Republic, Denmark, France (metropolitan), Germany, Gibraltar, Hungary, Italy, Liechtenstein, Luxembourg, Malta, Monaco, Montenegro, Netherlands (European), North Macedonia, Norway, Poland, San Marino, Serbia, Slovakia, Slovenia, Spain (most), Sweden, Switzerland, Vatican City with DST
ar: بوتسوانا، بوروندي، جمهورية الكونغو الديمقراطية (معظمها)، إسواتيني، ليسوتو، ليبيا، ملاوي، موزمبيق، ناميبيا، روسيا (كالينينغراد)، رواندا، جنوب أفريقيا (معظمها)، جنوب السودان، السودان، زامبيا، زيمبابوي؛ أكروتيري ودكليا، بلغاريا، قبرص، مصر، إستونيا، فنلندا، اليونان، إسرائيل، لاتفيا، لبنان، ليتوانيا، مولدوفا، فلسطين، رومانيا، أوكرانيا (معظمها) بدون توقيت صيفي؛ ألبانيا، أندورا، النمسا، بلجيكا، البوسنة والهرسك، كرواتيا، جمهورية التشيك، الدنمارك، فرنسا (العاصمة)، ألمانيا، جبل طارق، المجر، إيطاليا، ليختنشتاين، لوكسمبورغ، مالطا، موناكو، الجبل الأسود، هولندا (أوروبا)، مقدونيا الشمالية، النرويج، بولندا، سان مارينو، صربيا، سلوفاكيا، سلوفينيا، إسبانيا (معظمها)، السويد، سويسرا، مدينة الفاتيكان مع توقيت صيفي
ja: ボツワナ、ブルンジ、コンゴ民主共和国（大部分）、スワジランド、レソト、リビア、マラウイ、モザンビーク、ナミビア、ロシア（カリーニングラード）、ルワンダ、南アフリカ（大部分）、南スーダン、スーダン、ザンビア、ジンバブエ； アクロティリ・デケリア、ブルガリア、キプロス、エジプト、エストニア、フィンランド、ギリシャ、イスラエル、ラトビア、レバノン、リトアニア、モルドバ、パレスチナ、ルーマニア、ウクライナ（大部分の地域）は夏時間を実施しない； アルバニア、アンドラ、オーストリア、ベルギー、ボスニア・ヘルツェゴビナ、クロアチア、チェコ共和国、デンマーク、フランス（本土）、ドイツ、ジブラルタル、 ハンガリー、イタリア、リヒテンシュタイン、ルクセンブルク、マルタ、モナコ、モンテネグロ、オランダ（ヨーロッパ）、北マケドニア、ノルウェー、ポーランド、サンマリノ、セルビア、スロバキア、スロベニア、スペイン（大部分）、スウェーデン、スイス、バチカンは夏時間を実施
sv_se: Botswana, Burundi, DR Kongo (större delen), Eswatini, Lesotho, Libyen, Malawi, Moçambique, Namibia, Ryssland (Kaliningrad), Rwanda, Sydafrika (större delen), Sydsudan, Sudan, Zambia, Zimbabwe; Akrotiri och Dhekelia, Bulgarien, Cypern, Egypten, Estland, Finland, Grekland, Israel, Lettland, Libanon, Litauen, Moldavien, Palestina, Rumänien, Ukraina (större delen) utan sommartid; Albanien, Andorra, Österrike, Belgien, Bosnien och Hercegovina, Kroatien, Tjeckien, Danmark, Frankrike (metropolitan), Tyskland, Gibraltar, Ungern, Italien, Liechtenstein, Luxemburg, Malta, Monaco, Montenegro, Nederländerna (europeiska), Nordmakedonien, Norge, Polen, San Marino, Serbien, Slovakien, Slovenien, Spanien (större delen), Sverige, Schweiz, Vatikanstaten med sommartid
zh_cn: 博茨瓦纳、布隆迪、刚果民主共和国（大部分地区）、斯威士兰、莱索托、利比亚、马拉维、莫桑比克、纳米比亚、俄罗斯（加里宁格勒）、卢旺达、南非（大部分地区）、南苏丹、苏丹、赞比亚、津巴布韦； 阿克罗蒂里和德凯利亚、保加利亚、塞浦路斯、埃及、爱沙尼亚、芬兰、希腊、以色列、拉脱维亚、黎巴嫩、立陶宛、摩尔多瓦、巴勒斯坦、罗马尼亚、乌克兰（大部分地区）不实行夏令时； 阿尔巴尼亚、安道尔、奥地利、比利时、波斯尼亚和黑塞哥维那、克罗地亚、捷克共和国、丹麦、法国（本土）、德国、直布罗陀、匈牙利、意大利、列支敦士登、卢森堡、马耳他、摩纳哥、黑山、荷兰（欧洲）、北马其顿、挪威、波兰、圣马力诺、塞尔维亚、斯洛伐克、斯洛文尼亚、西班牙（大部分地区）、瑞典、瑞士、梵蒂冈实行夏令时
zh_hk: 博茨瓦納、布隆迪、剛果民主共和國（大部分）、斯威士蘭、萊索托、利比亞、馬拉維、莫桑比克、納米比亞、俄羅斯（加里寧格勒）、盧旺達、南非（大部分）、南蘇丹、蘇丹、贊比亞、津巴布韋； 阿克羅蒂里與德凱利亞、保加利亞、塞浦路斯、埃及、愛沙尼亞、芬蘭、希臘、以色列、拉脫維亞、黎巴嫩、立陶宛、摩爾多瓦、巴勒斯坦、羅馬尼亞、烏克蘭（大部分）不設夏令時間； 阿爾巴尼亞、安道爾、奧地利、比利時、波斯尼亞和黑塞哥維那、克羅地亞、捷克、丹麥、法國（本土）、德國、直布羅陀、匈牙利、意大利、列支敦士登、盧森堡、馬耳他、摩納哥、黑山、荷蘭（歐洲部分）、北馬其頓、挪威、波蘭、聖馬力諾、塞爾維亞、斯洛伐克、斯洛文尼亞、西班牙（大部分）、瑞典、瑞士、梵蒂岡城設夏令時間
zh_tw: 波札那、蒲隆地、剛果民主共和國（大部分地區）、史瓦濟蘭、賴索托、利比亞、馬拉威、莫三比克、納米比亞、俄羅斯（加里寧格勒）、盧安達、南非（大部分地區）、南蘇丹、蘇丹、尚比亞、辛巴威； 阿克羅蒂里和德凱利亞、保加利亞、塞浦路斯、埃及、愛沙尼亞、芬蘭、希臘、以色列、拉脫維亞、黎巴嫩、立陶宛、摩爾多瓦、巴勒斯坦、羅馬尼亞、烏克蘭（大部分地區）不實施夏令時； 阿爾巴尼亞、安道爾、奧地利、比利時、波士尼亞和黑塞哥維那、克羅埃西亞、捷克共和國、丹麥、法國（本土）、德國、直布羅陀、匈牙利、義大利、列支敦士登、盧森堡、馬耳他、摩納哥、蒙特內哥羅、荷蘭（歐洲）、北馬其頓、挪威、波蘭、聖馬利諾、塞爾維亞、斯洛伐克、斯洛維尼亞、西班牙（大部分地區）、瑞典、瑞士、梵蒂岡實施夏令時

# timeZone_pos0300
source: Bahrain, Belarus, Comoros, Djibouti, Eritrea, Ethiopia, French Southern and Antarctic Lands (Scattered Islands), Iraq, Jordan, Kenya, Kuwait, Madagascar, Mayotte, Qatar, Russia (most of European part), Saudi Arabia, Somalia, South Africa (Prince Edward Islands), Syria, Tanzania, Türkiye, Uganda, Ukraine (occupied territories), Yemen; Akrotiri and Dhekelia, Bulgaria, Cyprus, Egypt, Estonia, Finland, Greece, Israel, Latvia, Lebanon, Lithuania, Moldova, Palestine, Romania, Ukraine (most) with DST
ar: البحرين، بيلاروس، جزر القمر، جيبوتي، إريتريا، إثيوبيا، الأراضي الفرنسية الجنوبية والأنتارتيكية (الجزر المتناثرة)، العراق، الأردن، كينيا، الكويت، مدغشقر، مايوت، قطر، روسيا (معظم الجزء الأوروبي)، السعودية، الصومال، جنوب أفريقيا (جزر الأمير إدوارد)، سوريا، تنزانيا، تركيا، أوغندا، أوكرانيا (الأراضي المحتلة)، اليمن؛ أكروتيري ودكليا، بلغاريا، قبرص، مصر، إستونيا، فنلندا، اليونان، إسرائيل، لاتفيا، لبنان، ليتوانيا، مولدوفا، فلسطين، رومانيا، أوكرانيا (معظمها) مع توقيت صيفي
ja: バーレーン、ベラルーシ、コモロ、ジブチ、エリトリア、エチオピア、フランス領南極地域（分散島嶼）、イラク、ヨルダン、ケニア、クウェート、マダガスカル、マヨット島、カタール、ロシア（欧州大部分）、サウジアラビア、ソマリア、南アフリカ（プリンスエドワード諸島）、 シリア、タンザニア、トルコ、ウガンダ、ウクライナ（占領地域）、イエメン； アクロティリとデケリア、ブルガリア、キプロス、エジプト、エストニア、フィンランド、ギリシャ、イスラエル、ラトビア、レバノン、リトアニア、モルドバ、パレスチナ、ルーマニア、ウクライナ（大部分）は夏時間を実施
sv_se: Bahrain, Belarus, Komorerna, Djibouti, Eritrea, Etiopien, Franska södra territorierna (Spridda öarna), Irak, Jordanien, Kenya, Kuwait, Madagaskar, Mayotte, Qatar, Ryssland (större delen av den europeiska delen), Saudiarabien, Somalia, Sydafrika (Prince Edward Islands), Syrien, Tanzania, Turkiet, Uganda, Ukraina (ockuperade områden), Jemen; Akrotiri och Dhekelia, Bulgarien, Cypern, Egypten, Estland, Finland, Grekland, Israel, Lettland, Libanon, Litauen, Moldavien, Palestina, Rumänien, Ukraina (större delen) med sommartid
zh_cn: 巴林、白俄罗斯、科摩罗、吉布提、厄立特里亚、埃塞俄比亚、法属南极地区（分散岛屿）、伊拉克、约旦、肯尼亚、科威特、马达加斯加、马约特岛、卡塔尔、俄罗斯（欧洲大部分地区）、沙特阿拉伯、索马里、南非（爱德华王子群岛）、叙利亚、坦桑尼亚、土耳其、乌干达、乌克兰（被占领土）、也门； 阿克罗蒂里和德凯利亚、保加利亚、塞浦路斯、埃及、爱沙尼亚、芬兰、希腊、以色列、拉脱维亚、黎巴嫩、立陶宛、摩尔多瓦、巴勒斯坦、罗马尼亚、乌克兰（大部分地区）实行夏令时
zh_hk: 巴林、白俄羅斯、科摩羅、吉布提、厄立特里亞、埃塞俄比亞、法屬南部和南極領地（離島）、伊拉克、約旦、肯尼亞、科威特、馬達加斯加、馬約特、卡塔爾、俄羅斯（歐洲部分大部分）、沙特阿拉伯、索馬里、南非（愛德華王子群島）、敘利亞、坦桑尼亞、土耳其、烏干達、烏克蘭（被佔領地區）、也門； 阿克羅蒂里與德凱利亞、保加利亞、塞浦路斯、埃及、愛沙尼亞、芬蘭、希臘、以色列、拉脫維亞、黎巴嫩、立陶宛、摩爾多瓦、巴勒斯坦、羅馬尼亞、烏克蘭（大部分）設夏令時間
zh_tw: 巴林、白俄羅斯、科摩羅、吉布地、厄立特里亞、衣索比亞、法屬南極地區（分散島嶼）、伊拉克、約旦、肯亞、科威特、馬達加斯加、馬約特島、卡達、俄羅斯（歐洲大部分地區）、沙烏地阿拉伯、索馬利亞、南非（愛德華王子群島）、敘利亞、坦尚尼亞、土耳其、烏幹達、烏克蘭（被佔領地區）、葉門； 阿克羅蒂里和德凱利亞、保加利亞、塞浦路斯、埃及、愛沙尼亞、芬蘭、希臘、以色列、拉脫維亞、黎巴嫩、立陶宛、摩爾多瓦、巴勒斯坦、羅馬尼亞、烏克蘭（大部分地區）實施夏令時

# timeZone_pos0330
source: Iran
ar: إيران
ja: イラン
zh_cn: 伊朗
zh_hk: 伊朗
zh_tw: 伊朗

# timeZone_pos0400
source: Armenia, Azerbaijan, French Southern and Antarctic Lands (Crozet Islands), Georgia, Mauritius, Oman, Russia (Astrakhan, Samara, Saratov, Udmurtia, Ulyanovsk), Réunion, Seychelles, United Arab Emirates
ar: أرمينيا، أذربيجان، الأراضي الفرنسية الجنوبية والأنتارتيكية (جزر كروزيه)، جورجيا، موريشيوس، عمان، روسيا (أستراخان، سامارا، ساراتوف، أودمورتيا، أوليانوفسك)، ريونيون، سيشل، الإمارات العربية المتحدة
ja: アルメニア、アゼルバイジャン、フランス領南極地域（クロゼ諸島）、ジョージア、モーリシャス、オマーン、ロシア（アストラハン、サマラ、サラトフ、ウドムルト共和国、ウリヤノフスク）、レユニオン島、セーシェル、アラブ首長国連邦
sv_se: Armenien, Azerbajdzjan, Franska södra territorierna (Crozetöarna), Georgien, Mauritius, Oman, Ryssland (Astrachan, Samara, Saratov, Udmurtien, Uljanovsk), Réunion, Seychellerna, Förenade Arabemiraten
zh_cn: 亚美尼亚、阿塞拜疆、法属南极地区（克罗泽群岛）、格鲁吉亚、毛里求斯、阿曼、俄罗斯（阿斯特拉罕、萨马拉、萨拉托夫、乌德穆尔特共和国、乌里扬诺夫斯克）、留尼汪岛、塞舌尔、阿拉伯联合酋长国
zh_hk: 亞美尼亞、阿塞拜疆、法屬南部和南極領地（克羅澤群島）、格魯吉亞、毛里求斯、阿曼、俄羅斯（阿斯特拉罕、薩馬拉、薩拉托夫、烏德穆爾特、烏里揚諾夫斯克）、留尼旺、塞舌爾、阿聯酋
zh_tw: 亞美尼亞、亞塞拜然、法屬南極地區（克羅澤群島）、喬治亞、模里西斯、阿曼、俄羅斯（阿斯特拉罕、薩馬拉、薩拉托夫、烏德穆爾特共和國、烏裡揚諾夫斯克）、留尼汪島、塞席爾、阿拉伯聯合大公國

# timeZone_pos0430
source: Afghanistan
ar: أفغانستان
ja: アフガニスタン
zh_cn: 阿富汗
zh_hk: 阿富汗
zh_tw: 阿富汗

# timeZone_pos0500
source: French Southern and Antarctic Lands (Kerguelen Islands, Saint Paul Island, Amsterdam Island), Heard Island and McDonald Islands, Kazakhstan, Maldives, Pakistan, Russia (Bashkortostan, Chelyabinsk, Khanty-Mansi, Kurgan, Orenburg, Perm, Sverdlovsk, Tyumen, Yamalia), Tajikistan, Turkmenistan, Uzbekistan
ar: الأراضي الفرنسية الجنوبية والأنتارتيكية (جزر كيرغولين، جزيرة سان بول، جزيرة أمستردام)، جزيرة هيرد وجزر ماكدونالد، كازاخستان، جزر المالديف، باكستان، روسيا (باشكورستان، تشيليابينسك، خانتي-مانسي، كورغان، أورينبورغ، بيرم، سفيردلوفسك، تيومين، ياماليا)، طاجيكستان، تركمانستان، أوزبكستان
ja: フランス領南極地域（ケルゲラン諸島、サン・ポール島、アムステルダム島）、ヘド島・マクドナルド諸島、カザフスタン、モルディブ、パキスタン、ロシア（バシコルトスタン共和国、チェリャビンスク、ハンテ・マンシ、クルガン、オレンブルク、ペルミ、スヴェルドロフスク、チュメニ、ヤマル）、 タジキスタン、トルクメニスタン、ウズベキスタン
sv_se: Franska södra territorierna (Kerguelenöarna, Saint Paul Island, Amsterdam Island), Heard- och McDonaldöarna, Kazakstan, Maldiverna, Pakistan, Ryssland (Basjkirien, Tjeljabinsk, Chanty-Mansijsk, Kurgan, Orenburg, Perm, Sverdlovsk, Tiumen, Jamalien), Tadzjikistan, Turkmenistan, Uzbekistan
zh_cn: 法属南极地区（凯尔盖朗群岛、圣保罗岛、阿姆斯特丹岛）、赫德岛和麦克唐纳群岛、哈萨克斯坦、马尔代夫、巴基斯坦、俄罗斯（巴什科尔托斯坦、车里雅宾斯克、汉特-曼西、库尔干、奥伦堡、彼尔姆、斯维尔德洛夫斯克、秋明、亚马尔）、塔吉克斯坦、土库曼斯坦、乌兹别克斯坦
zh_hk: 法屬南部和南極領地（凱爾蓋朗群島、聖保羅島、阿姆斯特丹島）、赫德島和麥克唐納群島、哈薩克斯坦、馬爾代夫、巴基斯坦、俄羅斯（巴什科爾托斯坦、車里雅賓斯克、漢特-曼西、庫爾干、奧倫堡、彼爾姆、斯維爾德洛夫斯克、秋明、亞馬爾）、塔吉克斯坦、土庫曼斯坦、烏茲別克斯坦
zh_tw: 法屬南極地區（凱爾蓋朗群島、聖保羅島、阿姆斯特丹島）、赫德島和麥克唐納群島、哈薩克斯坦、馬爾地夫、巴基斯坦、俄羅斯（巴什科爾托斯坦、車里雅賓斯克、漢特-曼西、庫爾幹、奧倫堡、彼爾姆、斯維爾德洛夫斯克、秋明、亞馬爾）、塔吉克、土庫曼、烏茲別克
